{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      ",": 1,
      "-": 2,
      ".": 3,
      "0": 4,
      "1": 5,
      "2": 6,
      "3": 7,
      "4": 8,
      "5": 9,
      "6": 10,
      "7": 11,
      "8": 12,
      "9": 13,
      ":": 14,
      "=": 15,
      "A": 16,
      "B": 17,
      "D": 18,
      "E": 19,
      "F": 20,
      "G": 21,
      "K": 22,
      "L": 23,
      "P": 24,
      "R": 25,
      "S": 26,
      "T": 27,
      "W": 28,
      "[": 29,
      "]": 30,
      "a": 31,
      "c": 32,
      "e": 33,
      "g": 34,
      "i": 35,
      "l": 36,
      "m": 37,
      "n": 38,
      "o": 39,
      "r": 40,
      "s": 41,
      "t": 42,
      "u": 43,
      "y": 44,
      "Ċ": 45,
      "Ġ": 46,
      "En": 47,
      "em": 48,
      "ot": 49,
      "ĠEn": 50,
      "emy": 51,
      "ĠEnemy": 52,
      "Bot": 53,
      "re": 54,
      "ĠBot": 55,
      "=[": 56,
      "An": 57,
      "Are": 58,
      "Po": 59,
      "Rot": 60,
      "ce": 61,
      "eS": 62,
      "gl": 63,
      "na": 64,
      "ta": 65,
      "ĠEnemyAn": 66,
      "Arena": 67,
      "Pos": 68,
      "ĠEnemyAngl": 69,
      "ĠF": 70,
      "=-": 71,
      "Di": 72,
      "Ga": 73,
      "Re": 74,
      "ace": 75,
      "co": 76,
      "lt": 77,
      "meS": 78,
      "nce": 79,
      "su": 80,
      "sta": 81,
      "te": 82,
      "ĠGa": 83,
      "ĠRe": 84,
      "ĠEnemyRot": 85,
      "ĠEnemyPos": 86,
      "ĠEnemyDi": 87,
      "ĠBotRot": 88,
      "ĠBotArena": 89,
      "ĠBotPos": 90,
      "eSco": 91,
      "tate": 92,
      "ĠEnemyAngle": 93,
      "ĠEnemyAngleSco": 94,
      "ĠFace": 95,
      "meState": 96,
      "sult": 97,
      "stance": 98,
      "ĠGameState": 99,
      "ĠResult": 100,
      "ĠEnemyDistance": 101,
      "ĠEnemyAngleScore": 102,
      "ĠFaceArena": 103,
      "=[-": 104,
      "WD": 105,
      "ĠFWD": 106,
      "ĠT": 107,
      "11": 108,
      "SK": 109,
      "ĠSK": 110,
      "DS": 111,
      "ĠDS": 112,
      "00": 113,
      "16": 114,
      "89": 115,
      "ĠTR": 116,
      "12": 117,
      "ĠTL": 118,
      "14": 119,
      "13": 120,
      "01": 121,
      "15": 122,
      "17": 123,
      "27": 124,
      "99": 125,
      "10": 126,
      "18": 127,
      "25": 128,
      "30": 129,
      "19": 130,
      "26": 131,
      "29": 132,
      "24": 133,
      "20": 134,
      "35": 135,
      "28": 136,
      "34": 137,
      ",-": 138,
      "23": 139,
      "63": 140,
      "38": 141,
      "90": 142,
      "62": 143,
      "22": 144,
      "37": 145,
      "36": 146,
      "98": 147,
      "39": 148,
      "97": 149,
      "61": 150,
      "21": 151,
      "64": 152,
      "60": 153,
      "40": 154,
      "93": 155,
      "70": 156,
      "33": 157,
      "96": 158,
      "51": 159,
      "59": 160,
      "65": 161,
      "94": 162,
      "95": 163,
      "41": 164,
      "50": 165,
      "54": 166,
      "49": 167,
      "52": 168,
      "73": 169,
      "69": 170,
      "75": 171,
      "53": 172,
      "58": 173,
      "86": 174,
      "68": 175,
      "87": 176,
      "42": 177,
      "76": 178,
      "55": 179,
      "80": 180,
      "46": 181,
      "92": 182,
      "31": 183,
      "57": 184,
      "67": 185,
      "45": 186,
      "56": 187,
      "72": 188,
      "74": 189,
      "43": 190,
      "48": 191,
      "77": 192,
      "81": 193,
      "88": 194,
      "47": 195,
      "44": 196,
      "32": 197,
      "71": 198,
      "85": 199,
      "66": 200,
      "91": 201,
      "84": 202,
      "82": 203,
      "09": 204,
      "83": 205,
      "79": 206,
      "78": 207,
      "07": 208,
      "08": 209,
      "06": 210,
      "02": 211,
      "05": 212,
      "04": 213,
      "03": 214,
      "270": 215,
      "119": 216,
      "121": 217,
      "120": 218,
      "125": 219,
      "117": 220,
      "118": 221,
      "122": 222,
      "110": 223,
      "172": 224,
      "105": 225,
      "109": 226,
      "124": 227,
      "100": 228,
      "114": 229,
      "115": 230,
      "101": 231,
      "113": 232,
      "123": 233,
      "111": 234,
      "103": 235,
      "107": 236,
      "116": 237,
      "108": 238,
      "277": 239,
      "104": 240,
      "112": 241,
      "106": 242,
      "102": 243,
      "129": 244,
      "130": 245,
      "131": 246,
      "127": 247,
      "133": 248,
      "134": 249,
      "137": 250,
      "126": 251,
      "141": 252,
      "175": 253,
      "173": 254,
      "143": 255,
      "128": 256,
      "149": 257,
      "297": 258,
      "145": 259,
      "132": 260,
      "275": 261,
      "135": 262,
      "139": 263,
      "150": 264,
      "142": 265,
      "174": 266,
      "144": 267,
      "147": 268,
      "153": 269,
      "290": 270,
      "151": 271,
      "302": 272,
      "146": 273,
      "138": 274,
      "140": 275,
      "305": 276,
      "136": 277,
      "171": 278,
      "301": 279,
      "148": 280,
      "161": 281,
      "152": 282,
      "157": 283,
      "250": 284,
      "170": 285,
      "155": 286,
      "159": 287,
      "303": 288,
      "299": 289,
      "154": 290,
      "163": 291,
      "169": 292,
      "167": 293,
      "177": 294,
      "158": 295,
      "298": 296,
      "165": 297,
      "156": 298,
      "162": 299,
      "276": 300,
      "166": 301,
      "160": 302,
      "179": 303,
      "181": 304,
      "317": 305,
      "168": 306,
      "176": 307,
      "295": 308,
      "164": 309,
      "293": 310,
      "221": 311,
      "300": 312,
      "321": 313,
      "178": 314,
      "296": 315,
      "304": 316,
      "323": 317,
      "341": 318,
      "278": 319,
      "294": 320,
      "325": 321,
      "279": 322,
      "309": 323,
      "241": 324,
      "285": 325,
      "201": 326,
      "314": 327,
      "265": 328,
      "343": 329,
      "315": 330,
      "306": 331,
      "289": 332,
      "261": 333,
      "319": 334,
      "313": 335,
      "271": 336,
      "249": 337,
      "307": 338,
      "291": 339,
      "225": 340,
      "233": 341,
      "339": 342,
      "281": 343,
      "357": 344,
      "337": 345,
      "324": 346,
      "245": 347,
      "255": 348,
      "253": 349,
      "274": 350,
      "329": 351,
      "219": 352,
      "235": 353,
      "330": 354,
      "259": 355,
      "257": 356,
      "269": 357,
      "209": 358,
      "234": 359,
      "248": 360,
      "287": 361,
      "347": 362,
      "247": 363,
      "267": 364,
      "183": 365,
      "213": 366,
      "215": 367,
      "327": 368,
      "273": 369,
      "320": 370,
      "189": 371,
      "191": 372,
      "197": 373,
      "237": 374,
      "223": 375,
      "311": 376,
      "239": 377,
      "231": 378,
      "283": 379,
      "340": 380,
      "345": 381,
      "292": 382,
      "207": 383,
      "195": 384,
      "217": 385,
      "199": 386,
      "318": 387,
      "227": 388,
      "193": 389,
      "185": 390,
      "359": 391,
      "310": 392,
      "353": 393,
      "263": 394,
      "203": 395,
      "187": 396,
      "322": 397,
      "280": 398,
      "211": 399,
      "190": 400,
      "224": 401,
      "288": 402,
      "286": 403,
      "230": 404,
      "349": 405,
      "246": 406,
      "251": 407,
      "226": 408,
      "308": 409,
      "240": 410,
      "243": 411,
      "254": 412,
      "331": 413,
      "344": 414,
      "335": 415,
      "338": 416,
      "220": 417,
      "180": 418,
      "192": 419,
      "186": 420,
      "229": 421,
      "264": 422,
      "326": 423,
      "282": 424,
      "266": 425,
      "216": 426,
      "205": 427,
      "214": 428,
      "351": 429,
      "358": 430,
      "194": 431,
      "228": 432,
      "260": 433,
      "222": 434,
      "342": 435,
      "333": 436,
      "238": 437,
      "284": 438,
      "312": 439,
      "355": 440,
      "354": 441,
      "316": 442,
      "184": 443,
      "346": 444,
      "210": 445,
      "262": 446,
      "244": 447,
      "252": 448,
      "350": 449,
      "236": 450,
      "336": 451,
      "204": 452,
      "348": 453,
      "272": 454,
      "334": 455,
      "196": 456,
      "242": 457,
      "212": 458,
      "268": 459,
      "206": 460,
      "202": 461,
      "198": 462,
      "328": 463,
      "218": 464,
      "258": 465,
      "200": 466,
      "256": 467,
      "356": 468,
      "232": 469,
      "182": 470,
      "332": 471,
      "208": 472,
      "188": 473,
      "352": 474
    },
    "merges": [
      [
        "E",
        "n"
      ],
      [
        "e",
        "m"
      ],
      [
        "o",
        "t"
      ],
      [
        "Ġ",
        "En"
      ],
      [
        "em",
        "y"
      ],
      [
        "ĠEn",
        "emy"
      ],
      [
        "B",
        "ot"
      ],
      [
        "r",
        "e"
      ],
      [
        "Ġ",
        "Bot"
      ],
      [
        "=",
        "["
      ],
      [
        "A",
        "n"
      ],
      [
        "A",
        "re"
      ],
      [
        "P",
        "o"
      ],
      [
        "R",
        "ot"
      ],
      [
        "c",
        "e"
      ],
      [
        "e",
        "S"
      ],
      [
        "g",
        "l"
      ],
      [
        "n",
        "a"
      ],
      [
        "t",
        "a"
      ],
      [
        "ĠEnemy",
        "An"
      ],
      [
        "Are",
        "na"
      ],
      [
        "Po",
        "s"
      ],
      [
        "ĠEnemyAn",
        "gl"
      ],
      [
        "Ġ",
        "F"
      ],
      [
        "=",
        "-"
      ],
      [
        "D",
        "i"
      ],
      [
        "G",
        "a"
      ],
      [
        "R",
        "e"
      ],
      [
        "a",
        "ce"
      ],
      [
        "c",
        "o"
      ],
      [
        "l",
        "t"
      ],
      [
        "m",
        "eS"
      ],
      [
        "n",
        "ce"
      ],
      [
        "s",
        "u"
      ],
      [
        "s",
        "ta"
      ],
      [
        "t",
        "e"
      ],
      [
        "Ġ",
        "Ga"
      ],
      [
        "Ġ",
        "Re"
      ],
      [
        "ĠEnemy",
        "Rot"
      ],
      [
        "ĠEnemy",
        "Pos"
      ],
      [
        "ĠEnemy",
        "Di"
      ],
      [
        "ĠBot",
        "Rot"
      ],
      [
        "ĠBot",
        "Arena"
      ],
      [
        "ĠBot",
        "Pos"
      ],
      [
        "eS",
        "co"
      ],
      [
        "ta",
        "te"
      ],
      [
        "ĠEnemyAngl",
        "e"
      ],
      [
        "ĠEnemyAngl",
        "eSco"
      ],
      [
        "ĠF",
        "ace"
      ],
      [
        "meS",
        "tate"
      ],
      [
        "su",
        "lt"
      ],
      [
        "sta",
        "nce"
      ],
      [
        "ĠGa",
        "meState"
      ],
      [
        "ĠRe",
        "sult"
      ],
      [
        "ĠEnemyDi",
        "stance"
      ],
      [
        "ĠEnemyAngleSco",
        "re"
      ],
      [
        "ĠFace",
        "Arena"
      ],
      [
        "=[",
        "-"
      ],
      [
        "W",
        "D"
      ],
      [
        "ĠF",
        "WD"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "1",
        "1"
      ],
      [
        "S",
        "K"
      ],
      [
        "Ġ",
        "SK"
      ],
      [
        "D",
        "S"
      ],
      [
        "Ġ",
        "DS"
      ],
      [
        "0",
        "0"
      ],
      [
        "1",
        "6"
      ],
      [
        "8",
        "9"
      ],
      [
        "ĠT",
        "R"
      ],
      [
        "1",
        "2"
      ],
      [
        "ĠT",
        "L"
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "3"
      ],
      [
        "0",
        "1"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "7"
      ],
      [
        "2",
        "7"
      ],
      [
        "9",
        "9"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "8"
      ],
      [
        "2",
        "5"
      ],
      [
        "3",
        "0"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "6"
      ],
      [
        "2",
        "9"
      ],
      [
        "2",
        "4"
      ],
      [
        "2",
        "0"
      ],
      [
        "3",
        "5"
      ],
      [
        "2",
        "8"
      ],
      [
        "3",
        "4"
      ],
      [
        ",",
        "-"
      ],
      [
        "2",
        "3"
      ],
      [
        "6",
        "3"
      ],
      [
        "3",
        "8"
      ],
      [
        "9",
        "0"
      ],
      [
        "6",
        "2"
      ],
      [
        "2",
        "2"
      ],
      [
        "3",
        "7"
      ],
      [
        "3",
        "6"
      ],
      [
        "9",
        "8"
      ],
      [
        "3",
        "9"
      ],
      [
        "9",
        "7"
      ],
      [
        "6",
        "1"
      ],
      [
        "2",
        "1"
      ],
      [
        "6",
        "4"
      ],
      [
        "6",
        "0"
      ],
      [
        "4",
        "0"
      ],
      [
        "9",
        "3"
      ],
      [
        "7",
        "0"
      ],
      [
        "3",
        "3"
      ],
      [
        "9",
        "6"
      ],
      [
        "5",
        "1"
      ],
      [
        "5",
        "9"
      ],
      [
        "6",
        "5"
      ],
      [
        "9",
        "4"
      ],
      [
        "9",
        "5"
      ],
      [
        "4",
        "1"
      ],
      [
        "5",
        "0"
      ],
      [
        "5",
        "4"
      ],
      [
        "4",
        "9"
      ],
      [
        "5",
        "2"
      ],
      [
        "7",
        "3"
      ],
      [
        "6",
        "9"
      ],
      [
        "7",
        "5"
      ],
      [
        "5",
        "3"
      ],
      [
        "5",
        "8"
      ],
      [
        "8",
        "6"
      ],
      [
        "6",
        "8"
      ],
      [
        "8",
        "7"
      ],
      [
        "4",
        "2"
      ],
      [
        "7",
        "6"
      ],
      [
        "5",
        "5"
      ],
      [
        "8",
        "0"
      ],
      [
        "4",
        "6"
      ],
      [
        "9",
        "2"
      ],
      [
        "3",
        "1"
      ],
      [
        "5",
        "7"
      ],
      [
        "6",
        "7"
      ],
      [
        "4",
        "5"
      ],
      [
        "5",
        "6"
      ],
      [
        "7",
        "2"
      ],
      [
        "7",
        "4"
      ],
      [
        "4",
        "3"
      ],
      [
        "4",
        "8"
      ],
      [
        "7",
        "7"
      ],
      [
        "8",
        "1"
      ],
      [
        "8",
        "8"
      ],
      [
        "4",
        "7"
      ],
      [
        "4",
        "4"
      ],
      [
        "3",
        "2"
      ],
      [
        "7",
        "1"
      ],
      [
        "8",
        "5"
      ],
      [
        "6",
        "6"
      ],
      [
        "9",
        "1"
      ],
      [
        "8",
        "4"
      ],
      [
        "8",
        "2"
      ],
      [
        "0",
        "9"
      ],
      [
        "8",
        "3"
      ],
      [
        "7",
        "9"
      ],
      [
        "7",
        "8"
      ],
      [
        "0",
        "7"
      ],
      [
        "0",
        "8"
      ],
      [
        "0",
        "6"
      ],
      [
        "0",
        "2"
      ],
      [
        "0",
        "5"
      ],
      [
        "0",
        "4"
      ],
      [
        "0",
        "3"
      ],
      [
        "27",
        "0"
      ],
      [
        "11",
        "9"
      ],
      [
        "12",
        "1"
      ],
      [
        "12",
        "0"
      ],
      [
        "12",
        "5"
      ],
      [
        "11",
        "7"
      ],
      [
        "11",
        "8"
      ],
      [
        "12",
        "2"
      ],
      [
        "11",
        "0"
      ],
      [
        "17",
        "2"
      ],
      [
        "10",
        "5"
      ],
      [
        "10",
        "9"
      ],
      [
        "12",
        "4"
      ],
      [
        "1",
        "00"
      ],
      [
        "11",
        "4"
      ],
      [
        "11",
        "5"
      ],
      [
        "1",
        "01"
      ],
      [
        "11",
        "3"
      ],
      [
        "12",
        "3"
      ],
      [
        "11",
        "1"
      ],
      [
        "10",
        "3"
      ],
      [
        "10",
        "7"
      ],
      [
        "11",
        "6"
      ],
      [
        "10",
        "8"
      ],
      [
        "27",
        "7"
      ],
      [
        "10",
        "4"
      ],
      [
        "11",
        "2"
      ],
      [
        "10",
        "6"
      ],
      [
        "10",
        "2"
      ],
      [
        "12",
        "9"
      ],
      [
        "13",
        "0"
      ],
      [
        "13",
        "1"
      ],
      [
        "12",
        "7"
      ],
      [
        "13",
        "3"
      ],
      [
        "13",
        "4"
      ],
      [
        "13",
        "7"
      ],
      [
        "12",
        "6"
      ],
      [
        "14",
        "1"
      ],
      [
        "17",
        "5"
      ],
      [
        "17",
        "3"
      ],
      [
        "14",
        "3"
      ],
      [
        "12",
        "8"
      ],
      [
        "14",
        "9"
      ],
      [
        "29",
        "7"
      ],
      [
        "14",
        "5"
      ],
      [
        "13",
        "2"
      ],
      [
        "27",
        "5"
      ],
      [
        "13",
        "5"
      ],
      [
        "13",
        "9"
      ],
      [
        "15",
        "0"
      ],
      [
        "14",
        "2"
      ],
      [
        "17",
        "4"
      ],
      [
        "14",
        "4"
      ],
      [
        "14",
        "7"
      ],
      [
        "15",
        "3"
      ],
      [
        "29",
        "0"
      ],
      [
        "15",
        "1"
      ],
      [
        "30",
        "2"
      ],
      [
        "14",
        "6"
      ],
      [
        "13",
        "8"
      ],
      [
        "14",
        "0"
      ],
      [
        "30",
        "5"
      ],
      [
        "13",
        "6"
      ],
      [
        "17",
        "1"
      ],
      [
        "3",
        "01"
      ],
      [
        "14",
        "8"
      ],
      [
        "16",
        "1"
      ],
      [
        "15",
        "2"
      ],
      [
        "15",
        "7"
      ],
      [
        "25",
        "0"
      ],
      [
        "17",
        "0"
      ],
      [
        "15",
        "5"
      ],
      [
        "15",
        "9"
      ],
      [
        "30",
        "3"
      ],
      [
        "2",
        "99"
      ],
      [
        "15",
        "4"
      ],
      [
        "16",
        "3"
      ],
      [
        "16",
        "9"
      ],
      [
        "16",
        "7"
      ],
      [
        "17",
        "7"
      ],
      [
        "15",
        "8"
      ],
      [
        "29",
        "8"
      ],
      [
        "16",
        "5"
      ],
      [
        "15",
        "6"
      ],
      [
        "16",
        "2"
      ],
      [
        "27",
        "6"
      ],
      [
        "16",
        "6"
      ],
      [
        "16",
        "0"
      ],
      [
        "17",
        "9"
      ],
      [
        "18",
        "1"
      ],
      [
        "3",
        "17"
      ],
      [
        "16",
        "8"
      ],
      [
        "17",
        "6"
      ],
      [
        "29",
        "5"
      ],
      [
        "16",
        "4"
      ],
      [
        "29",
        "3"
      ],
      [
        "22",
        "1"
      ],
      [
        "3",
        "00"
      ],
      [
        "3",
        "21"
      ],
      [
        "17",
        "8"
      ],
      [
        "29",
        "6"
      ],
      [
        "30",
        "4"
      ],
      [
        "3",
        "23"
      ],
      [
        "34",
        "1"
      ],
      [
        "27",
        "8"
      ],
      [
        "29",
        "4"
      ],
      [
        "3",
        "25"
      ],
      [
        "27",
        "9"
      ],
      [
        "30",
        "9"
      ],
      [
        "24",
        "1"
      ],
      [
        "28",
        "5"
      ],
      [
        "2",
        "01"
      ],
      [
        "3",
        "14"
      ],
      [
        "26",
        "5"
      ],
      [
        "34",
        "3"
      ],
      [
        "3",
        "15"
      ],
      [
        "30",
        "6"
      ],
      [
        "2",
        "89"
      ],
      [
        "26",
        "1"
      ],
      [
        "3",
        "19"
      ],
      [
        "3",
        "13"
      ],
      [
        "27",
        "1"
      ],
      [
        "24",
        "9"
      ],
      [
        "30",
        "7"
      ],
      [
        "29",
        "1"
      ],
      [
        "2",
        "25"
      ],
      [
        "23",
        "3"
      ],
      [
        "3",
        "39"
      ],
      [
        "28",
        "1"
      ],
      [
        "35",
        "7"
      ],
      [
        "3",
        "37"
      ],
      [
        "3",
        "24"
      ],
      [
        "24",
        "5"
      ],
      [
        "25",
        "5"
      ],
      [
        "25",
        "3"
      ],
      [
        "27",
        "4"
      ],
      [
        "3",
        "29"
      ],
      [
        "2",
        "19"
      ],
      [
        "2",
        "35"
      ],
      [
        "3",
        "30"
      ],
      [
        "25",
        "9"
      ],
      [
        "25",
        "7"
      ],
      [
        "26",
        "9"
      ],
      [
        "20",
        "9"
      ],
      [
        "2",
        "34"
      ],
      [
        "24",
        "8"
      ],
      [
        "28",
        "7"
      ],
      [
        "34",
        "7"
      ],
      [
        "24",
        "7"
      ],
      [
        "26",
        "7"
      ],
      [
        "18",
        "3"
      ],
      [
        "2",
        "13"
      ],
      [
        "2",
        "15"
      ],
      [
        "3",
        "27"
      ],
      [
        "27",
        "3"
      ],
      [
        "3",
        "20"
      ],
      [
        "1",
        "89"
      ],
      [
        "19",
        "1"
      ],
      [
        "19",
        "7"
      ],
      [
        "23",
        "7"
      ],
      [
        "2",
        "23"
      ],
      [
        "3",
        "11"
      ],
      [
        "23",
        "9"
      ],
      [
        "23",
        "1"
      ],
      [
        "28",
        "3"
      ],
      [
        "34",
        "0"
      ],
      [
        "34",
        "5"
      ],
      [
        "29",
        "2"
      ],
      [
        "20",
        "7"
      ],
      [
        "19",
        "5"
      ],
      [
        "2",
        "17"
      ],
      [
        "1",
        "99"
      ],
      [
        "3",
        "18"
      ],
      [
        "2",
        "27"
      ],
      [
        "19",
        "3"
      ],
      [
        "18",
        "5"
      ],
      [
        "35",
        "9"
      ],
      [
        "3",
        "10"
      ],
      [
        "35",
        "3"
      ],
      [
        "26",
        "3"
      ],
      [
        "20",
        "3"
      ],
      [
        "18",
        "7"
      ],
      [
        "3",
        "22"
      ],
      [
        "28",
        "0"
      ],
      [
        "2",
        "11"
      ],
      [
        "19",
        "0"
      ],
      [
        "2",
        "24"
      ],
      [
        "28",
        "8"
      ],
      [
        "28",
        "6"
      ],
      [
        "2",
        "30"
      ],
      [
        "34",
        "9"
      ],
      [
        "24",
        "6"
      ],
      [
        "25",
        "1"
      ],
      [
        "2",
        "26"
      ],
      [
        "30",
        "8"
      ],
      [
        "24",
        "0"
      ],
      [
        "24",
        "3"
      ],
      [
        "25",
        "4"
      ],
      [
        "33",
        "1"
      ],
      [
        "34",
        "4"
      ],
      [
        "3",
        "35"
      ],
      [
        "3",
        "38"
      ],
      [
        "2",
        "20"
      ],
      [
        "18",
        "0"
      ],
      [
        "19",
        "2"
      ],
      [
        "18",
        "6"
      ],
      [
        "2",
        "29"
      ],
      [
        "26",
        "4"
      ],
      [
        "3",
        "26"
      ],
      [
        "28",
        "2"
      ],
      [
        "26",
        "6"
      ],
      [
        "2",
        "16"
      ],
      [
        "20",
        "5"
      ],
      [
        "2",
        "14"
      ],
      [
        "35",
        "1"
      ],
      [
        "35",
        "8"
      ],
      [
        "19",
        "4"
      ],
      [
        "2",
        "28"
      ],
      [
        "26",
        "0"
      ],
      [
        "22",
        "2"
      ],
      [
        "34",
        "2"
      ],
      [
        "33",
        "3"
      ],
      [
        "23",
        "8"
      ],
      [
        "28",
        "4"
      ],
      [
        "3",
        "12"
      ],
      [
        "35",
        "5"
      ],
      [
        "35",
        "4"
      ],
      [
        "3",
        "16"
      ],
      [
        "18",
        "4"
      ],
      [
        "34",
        "6"
      ],
      [
        "2",
        "10"
      ],
      [
        "26",
        "2"
      ],
      [
        "24",
        "4"
      ],
      [
        "25",
        "2"
      ],
      [
        "35",
        "0"
      ],
      [
        "23",
        "6"
      ],
      [
        "3",
        "36"
      ],
      [
        "20",
        "4"
      ],
      [
        "34",
        "8"
      ],
      [
        "27",
        "2"
      ],
      [
        "3",
        "34"
      ],
      [
        "19",
        "6"
      ],
      [
        "24",
        "2"
      ],
      [
        "2",
        "12"
      ],
      [
        "26",
        "8"
      ],
      [
        "20",
        "6"
      ],
      [
        "20",
        "2"
      ],
      [
        "19",
        "8"
      ],
      [
        "3",
        "28"
      ],
      [
        "2",
        "18"
      ],
      [
        "25",
        "8"
      ],
      [
        "2",
        "00"
      ],
      [
        "25",
        "6"
      ],
      [
        "35",
        "6"
      ],
      [
        "23",
        "2"
      ],
      [
        "18",
        "2"
      ],
      [
        "33",
        "2"
      ],
      [
        "20",
        "8"
      ],
      [
        "18",
        "8"
      ],
      [
        "35",
        "2"
      ]
    ]
  }
}