{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      ",": 1,
      "-": 2,
      ".": 3,
      "0": 4,
      "1": 5,
      "2": 6,
      "3": 7,
      "4": 8,
      "5": 9,
      "6": 10,
      "7": 11,
      "8": 12,
      "9": 13,
      ":": 14,
      "=": 15,
      "A": 16,
      "B": 17,
      "D": 18,
      "E": 19,
      "F": 20,
      "K": 21,
      "L": 22,
      "P": 23,
      "R": 24,
      "S": 25,
      "T": 26,
      "W": 27,
      "[": 28,
      "]": 29,
      "a": 30,
      "c": 31,
      "e": 32,
      "g": 33,
      "i": 34,
      "l": 35,
      "m": 36,
      "n": 37,
      "o": 38,
      "r": 39,
      "s": 40,
      "t": 41,
      "u": 42,
      "y": 43,
      "Ċ": 44,
      "Ġ": 45,
      "En": 46,
      "em": 47,
      "ot": 48,
      "ĠEn": 49,
      "emy": 50,
      "ĠEnemy": 51,
      "Bot": 52,
      "re": 53,
      "ĠBot": 54,
      "=[": 55,
      "An": 56,
      "Are": 57,
      "Po": 58,
      "Rot": 59,
      "ce": 60,
      "gl": 61,
      "na": 62,
      "ĠEnemyAn": 63,
      "Arena": 64,
      "Pos": 65,
      "gle": 66,
      "ĠEnemyAngle": 67,
      "ĠF": 68,
      "=-": 69,
      "Di": 70,
      "Re": 71,
      "Sc": 72,
      "an": 73,
      "ace": 74,
      "lt": 75,
      "ore": 76,
      "st": 77,
      "su": 78,
      "ĠRe": 79,
      "ĠEnemyRot": 80,
      "ĠEnemyPos": 81,
      "ĠEnemyDi": 82,
      "ĠBotRot": 83,
      "ĠBotArena": 84,
      "ĠBotPos": 85,
      "ĠEnemyAngleSc": 86,
      "ĠFace": 87,
      "ance": 88,
      "stance": 89,
      "sult": 90,
      "ĠResult": 91,
      "ĠEnemyDistance": 92,
      "ĠEnemyAngleScore": 93,
      "ĠFaceArena": 94,
      "=[-": 95,
      "ĠT": 96,
      "WD": 97,
      "ĠFWD": 98,
      "11": 99,
      "SK": 100,
      "ĠSK": 101,
      "DS": 102,
      "ĠDS": 103,
      "00": 104,
      "89": 105,
      "ĠTR": 106,
      "ĠTL": 107,
      "12": 108,
      "01": 109,
      "13": 110,
      "14": 111,
      "10": 112,
      "16": 113,
      "27": 114,
      "15": 115,
      "17": 116,
      "99": 117,
      "25": 118,
      "30": 119,
      "26": 120,
      "29": 121,
      "18": 122,
      "24": 123,
      "35": 124,
      "19": 125,
      "28": 126,
      "20": 127,
      "34": 128,
      ",-": 129,
      "23": 130,
      "63": 131,
      "38": 132,
      "90": 133,
      "62": 134,
      "98": 135,
      "37": 136,
      "36": 137,
      "22": 138,
      "39": 139,
      "97": 140,
      "64": 141,
      "61": 142,
      "40": 143,
      "93": 144,
      "21": 145,
      "70": 146,
      "33": 147,
      "96": 148,
      "60": 149,
      "51": 150,
      "94": 151,
      "65": 152,
      "59": 153,
      "95": 154,
      "41": 155,
      "50": 156,
      "54": 157,
      "52": 158,
      "49": 159,
      "73": 160,
      "69": 161,
      "58": 162,
      "75": 163,
      "53": 164,
      "68": 165,
      "86": 166,
      "42": 167,
      "80": 168,
      "92": 169,
      "76": 170,
      "85": 171,
      "55": 172,
      "87": 173,
      "31": 174,
      "46": 175,
      "56": 176,
      "74": 177,
      "72": 178,
      "45": 179,
      "67": 180,
      "57": 181,
      "32": 182,
      "43": 183,
      "81": 184,
      "48": 185,
      "47": 186,
      "88": 187,
      "44": 188,
      "71": 189,
      "77": 190,
      "91": 191,
      "66": 192,
      "84": 193,
      "82": 194,
      "09": 195,
      "83": 196,
      "79": 197,
      "78": 198,
      "07": 199,
      "08": 200,
      "06": 201,
      "02": 202,
      "05": 203,
      "04": 204,
      "03": 205,
      "270": 206,
      "119": 207,
      "121": 208,
      "120": 209,
      "125": 210,
      "117": 211,
      "118": 212,
      "122": 213,
      "110": 214,
      "172": 215,
      "105": 216,
      "109": 217,
      "124": 218,
      "100": 219,
      "114": 220,
      "115": 221,
      "101": 222,
      "113": 223,
      "123": 224,
      "111": 225,
      "103": 226,
      "107": 227,
      "116": 228,
      "108": 229,
      "277": 230,
      "104": 231,
      "112": 232,
      "106": 233,
      "102": 234,
      "129": 235,
      "130": 236,
      "131": 237,
      "127": 238,
      "133": 239,
      "134": 240,
      "137": 241,
      "126": 242,
      "141": 243,
      "175": 244,
      "173": 245,
      "143": 246,
      "128": 247,
      "149": 248,
      "297": 249,
      "145": 250,
      "132": 251,
      "275": 252,
      "135": 253,
      "139": 254,
      "150": 255,
      "142": 256,
      "174": 257,
      "144": 258,
      "147": 259,
      "153": 260,
      "290": 261,
      "151": 262,
      "302": 263,
      "146": 264,
      "138": 265,
      "140": 266,
      "305": 267,
      "136": 268,
      "171": 269,
      "301": 270,
      "148": 271,
      "161": 272,
      "152": 273,
      "157": 274,
      "250": 275,
      "170": 276,
      "155": 277,
      "159": 278,
      "303": 279,
      "299": 280,
      "154": 281,
      "163": 282,
      "169": 283,
      "167": 284,
      "177": 285,
      "158": 286,
      "298": 287,
      "165": 288,
      "156": 289,
      "162": 290,
      "276": 291,
      "166": 292,
      "160": 293,
      "179": 294,
      "181": 295,
      "317": 296,
      "168": 297,
      "176": 298,
      "295": 299,
      "164": 300,
      "293": 301,
      "221": 302,
      "300": 303,
      "321": 304,
      "178": 305,
      "296": 306,
      "304": 307,
      "323": 308,
      "341": 309,
      "278": 310,
      "294": 311,
      "325": 312,
      "279": 313,
      "309": 314,
      "241": 315,
      "285": 316,
      "201": 317,
      "314": 318,
      "265": 319,
      "343": 320,
      "315": 321,
      "306": 322,
      "289": 323,
      "261": 324,
      "319": 325,
      "313": 326,
      "271": 327,
      "249": 328,
      "307": 329,
      "291": 330,
      "225": 331,
      "233": 332,
      "339": 333,
      "281": 334,
      "357": 335,
      "337": 336,
      "324": 337,
      "245": 338,
      "255": 339,
      "253": 340,
      "274": 341,
      "329": 342,
      "219": 343,
      "235": 344,
      "330": 345,
      "259": 346,
      "257": 347,
      "269": 348,
      "209": 349,
      "234": 350,
      "248": 351,
      "287": 352,
      "347": 353,
      "247": 354,
      "267": 355,
      "183": 356,
      "213": 357,
      "215": 358,
      "327": 359,
      "273": 360,
      "320": 361,
      "189": 362,
      "191": 363,
      "197": 364,
      "237": 365,
      "223": 366,
      "311": 367,
      "239": 368,
      "231": 369,
      "283": 370,
      "340": 371,
      "345": 372,
      "292": 373,
      "207": 374,
      "195": 375,
      "217": 376,
      "199": 377,
      "318": 378,
      "227": 379,
      "193": 380,
      "185": 381,
      "359": 382,
      "310": 383,
      "353": 384,
      "263": 385,
      "203": 386,
      "187": 387,
      "322": 388,
      "280": 389,
      "211": 390,
      "190": 391,
      "224": 392,
      "288": 393,
      "286": 394,
      "230": 395,
      "349": 396,
      "246": 397,
      "251": 398,
      "226": 399,
      "308": 400,
      "240": 401,
      "243": 402,
      "254": 403,
      "331": 404,
      "344": 405,
      "335": 406,
      "338": 407,
      "220": 408,
      "180": 409,
      "192": 410,
      "186": 411,
      "229": 412,
      "264": 413,
      "326": 414,
      "282": 415,
      "266": 416,
      "216": 417,
      "205": 418,
      "214": 419,
      "351": 420,
      "358": 421,
      "194": 422,
      "228": 423,
      "260": 424,
      "222": 425,
      "342": 426,
      "333": 427,
      "238": 428,
      "284": 429,
      "312": 430,
      "355": 431,
      "354": 432,
      "316": 433,
      "184": 434,
      "346": 435,
      "210": 436,
      "262": 437,
      "244": 438,
      "252": 439,
      "350": 440,
      "236": 441,
      "336": 442,
      "204": 443,
      "348": 444,
      "272": 445,
      "334": 446,
      "196": 447,
      "242": 448,
      "212": 449,
      "268": 450,
      "206": 451,
      "202": 452,
      "198": 453,
      "328": 454,
      "218": 455,
      "258": 456,
      "200": 457,
      "256": 458,
      "356": 459,
      "232": 460,
      "182": 461,
      "332": 462,
      "208": 463,
      "188": 464,
      "352": 465
    },
    "merges": [
      [
        "E",
        "n"
      ],
      [
        "e",
        "m"
      ],
      [
        "o",
        "t"
      ],
      [
        "Ġ",
        "En"
      ],
      [
        "em",
        "y"
      ],
      [
        "ĠEn",
        "emy"
      ],
      [
        "B",
        "ot"
      ],
      [
        "r",
        "e"
      ],
      [
        "Ġ",
        "Bot"
      ],
      [
        "=",
        "["
      ],
      [
        "A",
        "n"
      ],
      [
        "A",
        "re"
      ],
      [
        "P",
        "o"
      ],
      [
        "R",
        "ot"
      ],
      [
        "c",
        "e"
      ],
      [
        "g",
        "l"
      ],
      [
        "n",
        "a"
      ],
      [
        "ĠEnemy",
        "An"
      ],
      [
        "Are",
        "na"
      ],
      [
        "Po",
        "s"
      ],
      [
        "gl",
        "e"
      ],
      [
        "ĠEnemyAn",
        "gle"
      ],
      [
        "Ġ",
        "F"
      ],
      [
        "=",
        "-"
      ],
      [
        "D",
        "i"
      ],
      [
        "R",
        "e"
      ],
      [
        "S",
        "c"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "ce"
      ],
      [
        "l",
        "t"
      ],
      [
        "o",
        "re"
      ],
      [
        "s",
        "t"
      ],
      [
        "s",
        "u"
      ],
      [
        "Ġ",
        "Re"
      ],
      [
        "ĠEnemy",
        "Rot"
      ],
      [
        "ĠEnemy",
        "Pos"
      ],
      [
        "ĠEnemy",
        "Di"
      ],
      [
        "ĠBot",
        "Rot"
      ],
      [
        "ĠBot",
        "Arena"
      ],
      [
        "ĠBot",
        "Pos"
      ],
      [
        "ĠEnemyAngle",
        "Sc"
      ],
      [
        "ĠF",
        "ace"
      ],
      [
        "an",
        "ce"
      ],
      [
        "st",
        "ance"
      ],
      [
        "su",
        "lt"
      ],
      [
        "ĠRe",
        "sult"
      ],
      [
        "ĠEnemyDi",
        "stance"
      ],
      [
        "ĠEnemyAngleSc",
        "ore"
      ],
      [
        "ĠFace",
        "Arena"
      ],
      [
        "=[",
        "-"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "W",
        "D"
      ],
      [
        "ĠF",
        "WD"
      ],
      [
        "1",
        "1"
      ],
      [
        "S",
        "K"
      ],
      [
        "Ġ",
        "SK"
      ],
      [
        "D",
        "S"
      ],
      [
        "Ġ",
        "DS"
      ],
      [
        "0",
        "0"
      ],
      [
        "8",
        "9"
      ],
      [
        "ĠT",
        "R"
      ],
      [
        "ĠT",
        "L"
      ],
      [
        "1",
        "2"
      ],
      [
        "0",
        "1"
      ],
      [
        "1",
        "3"
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "6"
      ],
      [
        "2",
        "7"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "7"
      ],
      [
        "9",
        "9"
      ],
      [
        "2",
        "5"
      ],
      [
        "3",
        "0"
      ],
      [
        "2",
        "6"
      ],
      [
        "2",
        "9"
      ],
      [
        "1",
        "8"
      ],
      [
        "2",
        "4"
      ],
      [
        "3",
        "5"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "8"
      ],
      [
        "2",
        "0"
      ],
      [
        "3",
        "4"
      ],
      [
        ",",
        "-"
      ],
      [
        "2",
        "3"
      ],
      [
        "6",
        "3"
      ],
      [
        "3",
        "8"
      ],
      [
        "9",
        "0"
      ],
      [
        "6",
        "2"
      ],
      [
        "9",
        "8"
      ],
      [
        "3",
        "7"
      ],
      [
        "3",
        "6"
      ],
      [
        "2",
        "2"
      ],
      [
        "3",
        "9"
      ],
      [
        "9",
        "7"
      ],
      [
        "6",
        "4"
      ],
      [
        "6",
        "1"
      ],
      [
        "4",
        "0"
      ],
      [
        "9",
        "3"
      ],
      [
        "2",
        "1"
      ],
      [
        "7",
        "0"
      ],
      [
        "3",
        "3"
      ],
      [
        "9",
        "6"
      ],
      [
        "6",
        "0"
      ],
      [
        "5",
        "1"
      ],
      [
        "9",
        "4"
      ],
      [
        "6",
        "5"
      ],
      [
        "5",
        "9"
      ],
      [
        "9",
        "5"
      ],
      [
        "4",
        "1"
      ],
      [
        "5",
        "0"
      ],
      [
        "5",
        "4"
      ],
      [
        "5",
        "2"
      ],
      [
        "4",
        "9"
      ],
      [
        "7",
        "3"
      ],
      [
        "6",
        "9"
      ],
      [
        "5",
        "8"
      ],
      [
        "7",
        "5"
      ],
      [
        "5",
        "3"
      ],
      [
        "6",
        "8"
      ],
      [
        "8",
        "6"
      ],
      [
        "4",
        "2"
      ],
      [
        "8",
        "0"
      ],
      [
        "9",
        "2"
      ],
      [
        "7",
        "6"
      ],
      [
        "8",
        "5"
      ],
      [
        "5",
        "5"
      ],
      [
        "8",
        "7"
      ],
      [
        "3",
        "1"
      ],
      [
        "4",
        "6"
      ],
      [
        "5",
        "6"
      ],
      [
        "7",
        "4"
      ],
      [
        "7",
        "2"
      ],
      [
        "4",
        "5"
      ],
      [
        "6",
        "7"
      ],
      [
        "5",
        "7"
      ],
      [
        "3",
        "2"
      ],
      [
        "4",
        "3"
      ],
      [
        "8",
        "1"
      ],
      [
        "4",
        "8"
      ],
      [
        "4",
        "7"
      ],
      [
        "8",
        "8"
      ],
      [
        "4",
        "4"
      ],
      [
        "7",
        "1"
      ],
      [
        "7",
        "7"
      ],
      [
        "9",
        "1"
      ],
      [
        "6",
        "6"
      ],
      [
        "8",
        "4"
      ],
      [
        "8",
        "2"
      ],
      [
        "0",
        "9"
      ],
      [
        "8",
        "3"
      ],
      [
        "7",
        "9"
      ],
      [
        "7",
        "8"
      ],
      [
        "0",
        "7"
      ],
      [
        "0",
        "8"
      ],
      [
        "0",
        "6"
      ],
      [
        "0",
        "2"
      ],
      [
        "0",
        "5"
      ],
      [
        "0",
        "4"
      ],
      [
        "0",
        "3"
      ],
      [
        "27",
        "0"
      ],
      [
        "11",
        "9"
      ],
      [
        "12",
        "1"
      ],
      [
        "12",
        "0"
      ],
      [
        "12",
        "5"
      ],
      [
        "11",
        "7"
      ],
      [
        "11",
        "8"
      ],
      [
        "12",
        "2"
      ],
      [
        "11",
        "0"
      ],
      [
        "17",
        "2"
      ],
      [
        "10",
        "5"
      ],
      [
        "10",
        "9"
      ],
      [
        "12",
        "4"
      ],
      [
        "1",
        "00"
      ],
      [
        "11",
        "4"
      ],
      [
        "11",
        "5"
      ],
      [
        "1",
        "01"
      ],
      [
        "11",
        "3"
      ],
      [
        "12",
        "3"
      ],
      [
        "11",
        "1"
      ],
      [
        "10",
        "3"
      ],
      [
        "10",
        "7"
      ],
      [
        "11",
        "6"
      ],
      [
        "10",
        "8"
      ],
      [
        "27",
        "7"
      ],
      [
        "10",
        "4"
      ],
      [
        "11",
        "2"
      ],
      [
        "10",
        "6"
      ],
      [
        "10",
        "2"
      ],
      [
        "12",
        "9"
      ],
      [
        "13",
        "0"
      ],
      [
        "13",
        "1"
      ],
      [
        "12",
        "7"
      ],
      [
        "13",
        "3"
      ],
      [
        "13",
        "4"
      ],
      [
        "13",
        "7"
      ],
      [
        "12",
        "6"
      ],
      [
        "14",
        "1"
      ],
      [
        "17",
        "5"
      ],
      [
        "17",
        "3"
      ],
      [
        "14",
        "3"
      ],
      [
        "12",
        "8"
      ],
      [
        "14",
        "9"
      ],
      [
        "29",
        "7"
      ],
      [
        "14",
        "5"
      ],
      [
        "13",
        "2"
      ],
      [
        "27",
        "5"
      ],
      [
        "13",
        "5"
      ],
      [
        "13",
        "9"
      ],
      [
        "15",
        "0"
      ],
      [
        "14",
        "2"
      ],
      [
        "17",
        "4"
      ],
      [
        "14",
        "4"
      ],
      [
        "14",
        "7"
      ],
      [
        "15",
        "3"
      ],
      [
        "29",
        "0"
      ],
      [
        "15",
        "1"
      ],
      [
        "30",
        "2"
      ],
      [
        "14",
        "6"
      ],
      [
        "13",
        "8"
      ],
      [
        "14",
        "0"
      ],
      [
        "30",
        "5"
      ],
      [
        "13",
        "6"
      ],
      [
        "17",
        "1"
      ],
      [
        "3",
        "01"
      ],
      [
        "14",
        "8"
      ],
      [
        "16",
        "1"
      ],
      [
        "15",
        "2"
      ],
      [
        "15",
        "7"
      ],
      [
        "25",
        "0"
      ],
      [
        "17",
        "0"
      ],
      [
        "15",
        "5"
      ],
      [
        "15",
        "9"
      ],
      [
        "30",
        "3"
      ],
      [
        "2",
        "99"
      ],
      [
        "15",
        "4"
      ],
      [
        "16",
        "3"
      ],
      [
        "16",
        "9"
      ],
      [
        "16",
        "7"
      ],
      [
        "17",
        "7"
      ],
      [
        "15",
        "8"
      ],
      [
        "29",
        "8"
      ],
      [
        "16",
        "5"
      ],
      [
        "15",
        "6"
      ],
      [
        "16",
        "2"
      ],
      [
        "27",
        "6"
      ],
      [
        "16",
        "6"
      ],
      [
        "16",
        "0"
      ],
      [
        "17",
        "9"
      ],
      [
        "18",
        "1"
      ],
      [
        "3",
        "17"
      ],
      [
        "16",
        "8"
      ],
      [
        "17",
        "6"
      ],
      [
        "29",
        "5"
      ],
      [
        "16",
        "4"
      ],
      [
        "29",
        "3"
      ],
      [
        "22",
        "1"
      ],
      [
        "3",
        "00"
      ],
      [
        "3",
        "21"
      ],
      [
        "17",
        "8"
      ],
      [
        "29",
        "6"
      ],
      [
        "30",
        "4"
      ],
      [
        "3",
        "23"
      ],
      [
        "34",
        "1"
      ],
      [
        "27",
        "8"
      ],
      [
        "29",
        "4"
      ],
      [
        "3",
        "25"
      ],
      [
        "27",
        "9"
      ],
      [
        "30",
        "9"
      ],
      [
        "24",
        "1"
      ],
      [
        "28",
        "5"
      ],
      [
        "2",
        "01"
      ],
      [
        "3",
        "14"
      ],
      [
        "26",
        "5"
      ],
      [
        "34",
        "3"
      ],
      [
        "3",
        "15"
      ],
      [
        "30",
        "6"
      ],
      [
        "2",
        "89"
      ],
      [
        "26",
        "1"
      ],
      [
        "3",
        "19"
      ],
      [
        "3",
        "13"
      ],
      [
        "27",
        "1"
      ],
      [
        "24",
        "9"
      ],
      [
        "30",
        "7"
      ],
      [
        "29",
        "1"
      ],
      [
        "2",
        "25"
      ],
      [
        "23",
        "3"
      ],
      [
        "3",
        "39"
      ],
      [
        "28",
        "1"
      ],
      [
        "35",
        "7"
      ],
      [
        "3",
        "37"
      ],
      [
        "3",
        "24"
      ],
      [
        "24",
        "5"
      ],
      [
        "25",
        "5"
      ],
      [
        "25",
        "3"
      ],
      [
        "27",
        "4"
      ],
      [
        "3",
        "29"
      ],
      [
        "2",
        "19"
      ],
      [
        "2",
        "35"
      ],
      [
        "3",
        "30"
      ],
      [
        "25",
        "9"
      ],
      [
        "25",
        "7"
      ],
      [
        "26",
        "9"
      ],
      [
        "20",
        "9"
      ],
      [
        "2",
        "34"
      ],
      [
        "24",
        "8"
      ],
      [
        "28",
        "7"
      ],
      [
        "34",
        "7"
      ],
      [
        "24",
        "7"
      ],
      [
        "26",
        "7"
      ],
      [
        "18",
        "3"
      ],
      [
        "2",
        "13"
      ],
      [
        "2",
        "15"
      ],
      [
        "3",
        "27"
      ],
      [
        "27",
        "3"
      ],
      [
        "3",
        "20"
      ],
      [
        "1",
        "89"
      ],
      [
        "19",
        "1"
      ],
      [
        "19",
        "7"
      ],
      [
        "23",
        "7"
      ],
      [
        "2",
        "23"
      ],
      [
        "3",
        "11"
      ],
      [
        "23",
        "9"
      ],
      [
        "23",
        "1"
      ],
      [
        "28",
        "3"
      ],
      [
        "34",
        "0"
      ],
      [
        "34",
        "5"
      ],
      [
        "29",
        "2"
      ],
      [
        "20",
        "7"
      ],
      [
        "19",
        "5"
      ],
      [
        "2",
        "17"
      ],
      [
        "1",
        "99"
      ],
      [
        "3",
        "18"
      ],
      [
        "2",
        "27"
      ],
      [
        "19",
        "3"
      ],
      [
        "18",
        "5"
      ],
      [
        "35",
        "9"
      ],
      [
        "3",
        "10"
      ],
      [
        "35",
        "3"
      ],
      [
        "26",
        "3"
      ],
      [
        "20",
        "3"
      ],
      [
        "18",
        "7"
      ],
      [
        "3",
        "22"
      ],
      [
        "28",
        "0"
      ],
      [
        "2",
        "11"
      ],
      [
        "19",
        "0"
      ],
      [
        "2",
        "24"
      ],
      [
        "28",
        "8"
      ],
      [
        "28",
        "6"
      ],
      [
        "2",
        "30"
      ],
      [
        "34",
        "9"
      ],
      [
        "24",
        "6"
      ],
      [
        "25",
        "1"
      ],
      [
        "2",
        "26"
      ],
      [
        "30",
        "8"
      ],
      [
        "24",
        "0"
      ],
      [
        "24",
        "3"
      ],
      [
        "25",
        "4"
      ],
      [
        "33",
        "1"
      ],
      [
        "34",
        "4"
      ],
      [
        "3",
        "35"
      ],
      [
        "3",
        "38"
      ],
      [
        "2",
        "20"
      ],
      [
        "18",
        "0"
      ],
      [
        "19",
        "2"
      ],
      [
        "18",
        "6"
      ],
      [
        "2",
        "29"
      ],
      [
        "26",
        "4"
      ],
      [
        "3",
        "26"
      ],
      [
        "28",
        "2"
      ],
      [
        "26",
        "6"
      ],
      [
        "2",
        "16"
      ],
      [
        "20",
        "5"
      ],
      [
        "2",
        "14"
      ],
      [
        "35",
        "1"
      ],
      [
        "35",
        "8"
      ],
      [
        "19",
        "4"
      ],
      [
        "2",
        "28"
      ],
      [
        "26",
        "0"
      ],
      [
        "22",
        "2"
      ],
      [
        "34",
        "2"
      ],
      [
        "33",
        "3"
      ],
      [
        "23",
        "8"
      ],
      [
        "28",
        "4"
      ],
      [
        "3",
        "12"
      ],
      [
        "35",
        "5"
      ],
      [
        "35",
        "4"
      ],
      [
        "3",
        "16"
      ],
      [
        "18",
        "4"
      ],
      [
        "34",
        "6"
      ],
      [
        "2",
        "10"
      ],
      [
        "26",
        "2"
      ],
      [
        "24",
        "4"
      ],
      [
        "25",
        "2"
      ],
      [
        "35",
        "0"
      ],
      [
        "23",
        "6"
      ],
      [
        "3",
        "36"
      ],
      [
        "20",
        "4"
      ],
      [
        "34",
        "8"
      ],
      [
        "27",
        "2"
      ],
      [
        "3",
        "34"
      ],
      [
        "19",
        "6"
      ],
      [
        "24",
        "2"
      ],
      [
        "2",
        "12"
      ],
      [
        "26",
        "8"
      ],
      [
        "20",
        "6"
      ],
      [
        "20",
        "2"
      ],
      [
        "19",
        "8"
      ],
      [
        "3",
        "28"
      ],
      [
        "2",
        "18"
      ],
      [
        "25",
        "8"
      ],
      [
        "2",
        "00"
      ],
      [
        "25",
        "6"
      ],
      [
        "35",
        "6"
      ],
      [
        "23",
        "2"
      ],
      [
        "18",
        "2"
      ],
      [
        "33",
        "2"
      ],
      [
        "20",
        "8"
      ],
      [
        "18",
        "8"
      ],
      [
        "35",
        "2"
      ]
    ]
  }
}