{
  "vocab_in": [
    "<PAD>",
    "<UNK>",
    "[ctx]",
    "enemy",
    "is",
    "0.42",
    "meters",
    "ahead,",
    "angle",
    "-154.1",
    "degrees,",
    "edge",
    "distance",
    "3.07,",
    "center",
    "3.94,",
    "stuck:",
    "false,",
    "behind:",
    "skill",
    "ready:",
    "true,",
    "dash",
    "true",
    "1.89",
    "123.7",
    "2.29,",
    "2.5,",
    "2.4",
    "2.5",
    "0.86,",
    "4.84,",
    "false",
    "2.11",
    "2.1",
    "1.07,",
    "2.13,",
    "1.56",
    "160.3",
    "3.32,",
    "3.09,",
    "2.43",
    "-135.2",
    "1.45,",
    "1.36,",
    "1.13",
    "124.4",
    "2.08,",
    "0.3,",
    "5.7",
    "0.35,",
    "3.79,",
    "1.44",
    "-123.3",
    "1.63,",
    "2.26,",
    "0.6",
    "-98.3",
    "4.81,",
    "3.67,",
    "0.93",
    "100.1",
    "3.59,",
    "3.1,",
    "1.69",
    "-124.8",
    "4.83,",
    "1.12,",
    "0.62",
    "42.3",
    "3.17,",
    "0.7,",
    "0.8",
    "159.0",
    "3.3,",
    "0.48,",
    "0.99",
    "160.4",
    "1.38,",
    "1.85",
    "-135.4",
    "0.71,",
    "1.23,",
    "2.0",
    "107.3",
    "2.87,",
    "0.69",
    "67.8",
    "4.33,",
    "4.45,",
    "0.31",
    "-25.8",
    "1.11,",
    "1.01,",
    "2.19",
    "74.1",
    "3.74,",
    "2.55,",
    "2.45",
    "-19.1",
    "3.55,",
    "2.88,",
    "-119.1",
    "0.21,",
    "0.06,",
    "1.76",
    "-83.5",
    "1.33,",
    "0.28,",
    "2.48",
    "-115.9",
    "1.88,",
    "3.98,",
    "0.92",
    "165.1",
    "3.45,",
    "1.67,",
    "1.67",
    "52.4",
    "3.15,",
    "4.18,",
    "2.23",
    "146.7",
    "3.68,",
    "1.53",
    "-131.3",
    "1.71,",
    "4.11,",
    "2.39",
    "53.4",
    "4.63,",
    "2.44,",
    "1.43",
    "-25.6",
    "0.45,",
    "1.19,",
    "-6.2",
    "1.31",
    "-175.5",
    "3.89,",
    "0.78,",
    "0.22",
    "-140.2",
    "1.15,",
    "0.51,",
    "0.84",
    "-114.2",
    "0.75,",
    "4.5,",
    "-91.3",
    "1.75,",
    "4.79,",
    "16.3",
    "0.12,",
    "1.37",
    "24.8",
    "0.42,",
    "1.15",
    "-132.1",
    "2.36,",
    "2.65,",
    "1.35",
    "-19.8",
    "4.31,",
    "0.65,",
    "1.96",
    "92.7",
    "0.37,",
    "2.27",
    "49.7",
    "4.09,",
    "3.86,",
    "2.17",
    "-162.3",
    "3.72,",
    "1.64",
    "-4.5",
    "2.21,",
    "1.6",
    "148.5",
    "4.01,",
    "2.31,",
    "1.02",
    "119.2",
    "3.24,",
    "0.64,",
    "2.13",
    "152.1",
    "3.62,",
    "62.4",
    "4.78,",
    "1.48,",
    "-10.4",
    "1.1,",
    "0.17",
    "-109.2",
    "3.65,",
    "-3.2",
    "0.53,",
    "4.16,",
    "1.91",
    "73.6",
    "0.36,",
    "0.4",
    "122.0",
    "4.06,",
    "3.01,",
    "1.84",
    "-122.6",
    "3.34,",
    "2.05,",
    "-139.1",
    "2.96,",
    "87.9",
    "3.49,",
    "4.61,",
    "43.3",
    "1.98,",
    "50.3",
    "3.12,",
    "3.0,",
    "1.42",
    "-84.6",
    "0.94,",
    "0.65",
    "32.5",
    "0.98,",
    "1.14,",
    "0.64",
    "0.93,",
    "2.48,",
    "0.2",
    "-53.1",
    "4.71,",
    "3.7,",
    "0.88",
    "-131.7",
    "1.28,",
    "2.44",
    "-27.8",
    "0.46,",
    "3.75,",
    "175.2",
    "4.21,",
    "2.15",
    "-150.9",
    "2.12,",
    "2.94,",
    "2.35",
    "4.62,",
    "1.99",
    "70.9",
    "0.68,",
    "0.26",
    "-155.4",
    "0.02,",
    "1.92",
    "146.3",
    "4.72,",
    "2.72,",
    "2.21",
    "-42.2",
    "2.7,",
    "1.18,",
    "0.21",
    "87.7",
    "1.62,",
    "-5.9",
    "4.26,",
    "1.93",
    "134.3",
    "0.17,",
    "131.1",
    "4.02,",
    "1.05",
    "-3.1",
    "4.66,",
    "1.74,",
    "1.79",
    "-161.1",
    "3.57,",
    "0.01,",
    "-3.0",
    "2.39,",
    "2.0,",
    "119.6",
    "3.33,",
    "4.87,",
    "0.55",
    "10.7",
    "4.85,",
    "2.05",
    "-120.2",
    "0.57,",
    "-105.7",
    "1.53,",
    "-167.9",
    "3.26,",
    "4.6,",
    "0.45",
    "-120.5",
    "5.0,",
    "1.72",
    "166.8",
    "0.66,",
    "0.55,",
    "1.29",
    "-20.9",
    "0.67,",
    "2.35,",
    "1.08",
    "-69.0",
    "1.2,",
    "3.66,",
    "0.74",
    "54.9",
    "-179.4",
    "4.07,",
    "-14.2",
    "3.91,",
    "1.68,",
    "0.76",
    "67.5",
    "2.25",
    "155.7",
    "4.3,",
    "3.95,",
    "0.29",
    "-151.4",
    "0.91,",
    "132.0",
    "4.28,",
    "0.12",
    "-153.1",
    "2.54,",
    "-16.7",
    "1.97,",
    "155.0",
    "1.56,",
    "1.62",
    "37.2",
    "2.82,",
    "3.02,",
    "1.88",
    "-7.9",
    "2.33,",
    "2.14",
    "-48.6",
    "0.87,",
    "0.71",
    "-159.3",
    "3.88,",
    "4.89,",
    "1.3",
    "-159.6",
    "3.42,",
    "3.21,",
    "2.36",
    "75.4",
    "2.15,",
    "1.58",
    "65.6",
    "0.32,",
    "-80.5",
    "2.74,",
    "119.7",
    "2.66,",
    "1.55",
    "143.3",
    "4.69,",
    "4.04,",
    "-38.5",
    "0.9,",
    "2.04",
    "142.0",
    "2.04,",
    "-117.8",
    "3.69,",
    "2.76,",
    "1.9",
    "78.2",
    "0.79,",
    "4.95,",
    "0.52",
    "77.4",
    "1.31,",
    "1.38",
    "-60.0",
    "3.04,",
    "2.2",
    "2.06,",
    "103.0",
    "4.75,",
    "39.5",
    "0.47,",
    "175.3",
    "0.56,",
    "0.23,",
    "1.52",
    "-124.0",
    "4.17,",
    "0.3",
    "-102.3",
    "4.05,",
    "2.57,",
    "0.75",
    "-172.7",
    "4.25,",
    "-26.4",
    "123.3",
    "4.57,",
    "0.11,",
    "-171.8",
    "128.0",
    "1.02,",
    "69.0",
    "4.15,",
    "-17.6",
    "4.67,",
    "1.36",
    "34.1",
    "2.62,",
    "112.6",
    "1.86,",
    "0.81,",
    "1.94",
    "119.8",
    "1.27,",
    "-67.7",
    "0.89,",
    "172.3",
    "0.83",
    "-132.9",
    "1.17,",
    "1.81",
    "-82.5",
    "0.62,",
    "1.25",
    "130.2",
    "2.58,",
    "1.2",
    "21.9",
    "1.69,",
    "4.08,",
    "0.7",
    "61.2",
    "4.82,",
    "2.34,",
    "0.54",
    "2.97,",
    "3.4,",
    "85.3",
    "4.92,",
    "0.22,",
    "0.24",
    "-74.6",
    "4.76,",
    "75.3",
    "2.19,",
    "4.36,",
    "1.03",
    "166.4",
    "1.91,",
    "2.38,",
    "134.6",
    "4.24,",
    "0.59,",
    "142.4",
    "3.38,",
    "45.9",
    "0.04,",
    "1.51",
    "20.8",
    "0.95",
    "78.6",
    "1.03,",
    "-92.0",
    "1.06,",
    "-146.9",
    "4.19,",
    "-171.7",
    "1.96,",
    "2.01",
    "-53.0",
    "3.46,",
    "3.54,",
    "1.1",
    "6.9",
    "1.05,",
    "0.49",
    "-41.9",
    "3.8,",
    "18.7",
    "3.77,",
    "4.12,",
    "-179.9",
    "4.94,",
    "3.5,",
    "0.34",
    "2.11,",
    "1.24,",
    "1.68",
    "92.5",
    "4.22,",
    "1.7",
    "-108.2",
    "1.89,",
    "161.8",
    "4.49,",
    "4.93,",
    "2.26",
    "67.3",
    "1.22",
    "28.2",
    "4.53,",
    "0.43",
    "-71.6",
    "2.71,",
    "2.03,",
    "0.36",
    "9.8",
    "0.83,",
    "3.19,",
    "1.47",
    "-106.1",
    "1.47,",
    "0.73",
    "-114.3",
    "1.4,",
    "1.32",
    "144.8",
    "4.99,",
    "4.48,",
    "2.09",
    "131.2",
    "3.28,",
    "42.8",
    "3.83,",
    "3.96,",
    "-113.8",
    "3.14,",
    "-164.8",
    "0.61,",
    "25.0",
    "100.7",
    "2.53,",
    "-149.6",
    "1.66,",
    "0.16",
    "70.1",
    "3.71,",
    "4.43,",
    "-64.2",
    "1.26,",
    "47.2",
    "1.45",
    "-58.1",
    "1.23",
    "-65.4",
    "83.2",
    "2.68,",
    "0.15",
    "1.92,",
    "146.6",
    "3.37,",
    "0.69,",
    "-130.3",
    "3.64,",
    "0.19",
    "-169.4",
    "1.87",
    "106.2",
    "2.16,",
    "104.7",
    "0.38,",
    "-84.8",
    "0.2,",
    "1.78",
    "-109.6",
    "85.1",
    "2.17,",
    "2.18,",
    "13.4",
    "2.49,",
    "1.04",
    "59.3",
    "-99.7",
    "0.39,",
    "1.07",
    "34.6",
    "0.99,",
    "1.97",
    "6.7",
    "4.55,",
    "5.0",
    "3.73,",
    "121.8",
    "4.68,",
    "1.09",
    "75.5",
    "3.13,",
    "0.33",
    "114.4",
    "2.24",
    "165.7",
    "2.3",
    "-116.2",
    "4.1,",
    "3.31,",
    "1.4",
    "170.3",
    "3.84,",
    "0.92,",
    "-122.5",
    "-70.1",
    "154.5",
    "2.3,",
    "125.7",
    "-167.4",
    "1.55,",
    "1.72,",
    "1.17",
    "-42.5",
    "4.98,",
    "2.31",
    "158.3",
    "-152.3",
    "0.14,",
    "-35.8",
    "3.87,",
    "95.7",
    "0.11",
    "169.5",
    "2.45,",
    "19.8",
    "0.44,",
    "3.23,",
    "-14.4",
    "0.82,",
    "1.13,",
    "-169.3",
    "3.35,",
    "3.51,",
    "-75.8",
    "0.84,",
    "-47.5",
    "0.5,",
    "2.42",
    "148.6",
    "1.44,",
    "0.96",
    "179.4",
    "17.8",
    "0.96,",
    "-7.7",
    "1.42,",
    "4.58,",
    "31.6",
    "2.59,",
    "2.46,",
    "66.9",
    "3.58,",
    "3.03,",
    "0.87",
    "56.3",
    "0.33,",
    "21.7",
    "4.73,",
    "0.78",
    "-21.6",
    "3.47,",
    "2.78,",
    "-0.0",
    "3.76,",
    "42.9",
    "2.16",
    "-27.4",
    "4.77,",
    "-47.9",
    "4.27,",
    "113.4",
    "3.48,",
    "0.89",
    "-168.2",
    "2.91,",
    "0.44",
    "19.0",
    "3.81,",
    "139.8",
    "1.04,",
    "2.22",
    "7.0",
    "2.24,",
    "4.5",
    "171.4",
    "1.41,",
    "-79.9",
    "3.39,",
    "-157.3",
    "0.1,",
    "0.13",
    "-178.6",
    "1.39",
    "124.7",
    "-115.0",
    "-25.1",
    "2.28",
    "42.7",
    "2.51,",
    "1.87,",
    "-134.2",
    "2.69,",
    "-119.0",
    "0.85,",
    "104.9",
    "-61.2",
    "1.16,",
    "164.9",
    "0.72,",
    "148.2",
    "2.4,",
    "-94.8",
    "1.26",
    "-64.6",
    "3.99,",
    "-9.0",
    "2.22,",
    "-33.2",
    "1.78,",
    "-87.4",
    "3.56,",
    "-139.6",
    "2.92,",
    "112.2",
    "0.8,",
    "-84.5",
    "-27.6",
    "4.56,",
    "3.9,",
    "-77.1",
    "0.88,",
    "0.48",
    "-130.5",
    "4.47,",
    "2.47",
    "-99.9",
    "1.65,",
    "2.12",
    "-33.4",
    "-52.7",
    "1.28",
    "-52.0",
    "3.63,",
    "1.66",
    "-112.5",
    "2.84,",
    "0.81",
    "-62.9",
    "0.39",
    "-41.0",
    "1.58,",
    "1.34,",
    "-74.5",
    "0.82",
    "115.7",
    "2.42,",
    "-134.6",
    "4.9,",
    "143.4",
    "81.1",
    "1.76,",
    "-134.8",
    "0.14",
    "36.0",
    "0.18,",
    "88.6",
    "3.29,",
    "0.98",
    "2.93,",
    "3.36,",
    "-175.3",
    "1.9,",
    "2.46",
    "21.2",
    "3.78,",
    "0.58",
    "2.9,",
    "9.5",
    "1.27",
    "-127.4",
    "1.37,",
    "143.7",
    "3.08,",
    "0.67",
    "-177.0",
    "-129.9",
    "3.61,",
    "1.57",
    "15.5",
    "4.52,",
    "1.5",
    "14.8",
    "41.1",
    "3.85,",
    "-30.9",
    "1.95,",
    "83.7",
    "1.59,",
    "0.52,",
    "1.21",
    "-103.6",
    "2.8,",
    "-97.6",
    "4.7,",
    "-22.9",
    "2.63,",
    "0.05,",
    "127.7",
    "4.64,",
    "65.7",
    "76.4",
    "4.23,",
    "-90.4",
    "-76.4",
    "-1.1",
    "1.86",
    "-168.6",
    "67.9",
    "0.97",
    "-79.3",
    "2.47,",
    "0.35",
    "-178.4",
    "1.46,",
    "51.7",
    "-34.8",
    "0.15,",
    "173.8",
    "0.73,",
    "-174.8",
    "2.37",
    "-4.3",
    "78.4",
    "1.18",
    "-172.0",
    "4.41,",
    "-68.6",
    "0.58,",
    "-158.7",
    "126.3",
    "2.07",
    "-58.4",
    "3.93,",
    "-58.6",
    "1.8",
    "-54.2",
    "3.27,",
    "116.7",
    "3.22,",
    "1.73,",
    "7.7",
    "1.54,",
    "2.99,",
    "-154.0",
    "3.06,",
    "-133.4",
    "-76.3",
    "173.5",
    "2.77,",
    "130.0",
    "2.79,",
    "2.08",
    "-151.7",
    "-72.7",
    "-47.3",
    "1.83",
    "99.1",
    "2.18",
    "-88.5",
    "0.43,",
    "1.35,",
    "1.65",
    "3.2,",
    "-113.3",
    "-110.9",
    "2.98,",
    "118.7",
    "2.27,",
    "2.29",
    "-34.7",
    "3.18,",
    "0.23",
    "64.3",
    "-155.2",
    "1.57,",
    "0.29,",
    "0.25",
    "68.4",
    "117.8",
    "77.7",
    "0.56",
    "-79.0",
    "1.3,",
    "163.4",
    "130.5",
    "-119.2",
    "0.63",
    "79.3",
    "0.24,",
    "179.7",
    "2.37,",
    "168.3",
    "1.21,",
    "-156.7",
    "-176.1",
    "1.11",
    "-7.4",
    "1.84,",
    "1.12",
    "152.3",
    "-6.0",
    "2.01,",
    "9.0",
    "0.41,",
    "-19.4",
    "2.38",
    "3.1",
    "1.61,",
    "1.54",
    "77.3",
    "1.25,",
    "1.49",
    "-164.0",
    "-96.2",
    "3.6,",
    "59.6",
    "0.72",
    "-92.6",
    "0.74,",
    "2.75,",
    "1.41",
    "83.8",
    "84.8",
    "1.93,",
    "-143.0",
    "0.13,",
    "-62.8",
    "1.43,",
    "-130.9",
    "3.53,",
    "2.02",
    "-116.9",
    "1.77,",
    "0.32",
    "167.2",
    "3.11,",
    "95.0",
    "2.28,",
    "-42.7",
    "79.7",
    "1.08,",
    "114.3",
    "-79.2",
    "-21.5",
    "2.2,",
    "-39.7",
    "1.01",
    "133.8",
    "-85.5",
    "8.2",
    "66.4",
    "60.4",
    "1.83,",
    "1.98",
    "1.32,",
    "0.85",
    "156.4",
    "0.27",
    "-57.4",
    "0.86",
    "-62.7",
    "-144.0",
    "0.95,",
    "-34.1",
    "0.51",
    "-55.9",
    "1.59",
    "99.9",
    "118.0",
    "3.92,",
    "178.3",
    "3.25,",
    "24.3",
    "79.0",
    "0.37",
    "46.9",
    "-80.7",
    "98.9",
    "-57.6",
    "2.86,",
    "18.9",
    "4.97,",
    "1.77",
    "171.6",
    "125.1",
    "0.97,",
    "1.8,",
    "59.2",
    "0.16,",
    "-39.8",
    "-139.4",
    "0.5",
    "44.4",
    "1.75",
    "101.6",
    "178.9",
    "-115.1",
    "1.0",
    "-103.9",
    "1.99,",
    "34.3",
    "47.7",
    "0.76,",
    "0.46",
    "-113.4",
    "61.5",
    "2.49",
    "162.9",
    "105.0",
    "2.6,",
    "38.3",
    "4.54,",
    "0.18",
    "67.1",
    "1.6,",
    "1.74",
    "73.4",
    "4.88,",
    "142.8",
    "34.0",
    "-126.6",
    "-172.1",
    "72.9",
    "-107.0",
    "140.4",
    "-137.4",
    "-70.7",
    "-165.6",
    "4.13,",
    "-92.3",
    "0.94",
    "-107.1",
    "4.0,",
    "23.8",
    "-127.1",
    "-115.2",
    "-137.6",
    "2.52,",
    "2.1,",
    "2.56,",
    "58.4",
    "-124.1",
    "-97.2",
    "4.03,",
    "164.2",
    "0.66",
    "2.89,",
    "60.0",
    "-148.4",
    "66.7",
    "-114.5",
    "1.39,",
    "-75.1",
    "-164.5",
    "52.2",
    "2.41,",
    "-71.8",
    "-131.0",
    "-42.8",
    "30.6",
    "1.16",
    "111.4",
    "0.31,",
    "-70.2",
    "1.73",
    "23.3",
    "178.6",
    "2.14,",
    "99.4",
    "1.82,",
    "-80.0",
    "174.1",
    "140.3",
    "-158.3",
    "-164.1",
    "3.52,",
    "-178.9",
    "0.6,",
    "3.97,",
    "0.38",
    "-58.5",
    "172.6",
    "4.46,",
    "1.63",
    "89.9",
    "-70.0",
    "95.2",
    "158.8",
    "2.32",
    "115.8",
    "-38.7",
    "21.6",
    "0.4,",
    "-104.3",
    "-20.5",
    "7.5",
    "-60.6",
    "-54.1",
    "4.8,",
    "35.1",
    "108.8",
    "149.7",
    "3.41,",
    "143.9",
    "pos:-3.30,1.11;",
    "rot:270;",
    "vel:0.00,0.00;",
    "ang_vel:0.00",
    "pos:3.70,1.11;",
    "rot:90;",
    "pos:1.03,1.11;",
    "rot:164;",
    "vel:0.66,-0.00;",
    "ang_vel:121.41",
    "pos:1.22,1.11;",
    "rot:197;",
    "vel:0.30,-0.00;",
    "ang_vel:51.52",
    "pos:1.24,1.04;",
    "rot:198;",
    "vel:1.18,-3.82;",
    "ang_vel:49.46",
    "pos:-1.05,1.11;",
    "rot:18;",
    "vel:-0.06,-0.00;",
    "ang_vel:10.92",
    "pos:-0.95,1.11;",
    "vel:-0.28,-0.00;",
    "pos:-0.61,-0.25;",
    "rot:356;",
    "vel:0.07,4.00;",
    "ang_vel:4.27",
    "pos:-0.05,1.26;",
    "rot:26;",
    "vel:1.11,2.24;",
    "ang_vel:99.52",
    "pos:0.27,1.90;",
    "rot:54;",
    "vel:0.47,0.95;",
    "ang_vel:40.54",
    "pos:-1.68,2.59;",
    "rot:23;",
    "vel:-0.28,0.68;",
    "ang_vel:82.22",
    "rot:24;",
    "pos:-1.35,3.03;",
    "rot:83;",
    "vel:-0.36,0.32;",
    "ang_vel:11.28",
    "pos:-2.99,3.11;",
    "rot:111;",
    "vel:-0.57,0.18;",
    "ang_vel:53.82",
    "pos:-1.96,3.11;",
    "rot:84;",
    "vel:-3.98,0.42;",
    "ang_vel:8.14",
    "rot:268;",
    "pos:0.46,1.34;",
    "rot:155;",
    "vel:-0.09,0.25;",
    "ang_vel:66.35",
    "pos:0.44,1.38;",
    "rot:166;",
    "vel:-0.06,0.16;",
    "ang_vel:44.11",
    "pos:0.30,0.63;",
    "rot:173;",
    "vel:-0.52,-3.97;",
    "ang_vel:29.33",
    "pos:-0.91,0.32;",
    "rot:329;",
    "vel:-0.20,-0.20;",
    "ang_vel:39.77",
    "pos:-0.90,0.33;",
    "rot:351;",
    "vel:-0.23,-0.23;",
    "ang_vel:44.95",
    "pos:-1.75,0.50;",
    "rot:299;",
    "vel:0.51,1.32;",
    "ang_vel:-48.22",
    "pos:-1.63,0.83;",
    "rot:286;",
    "vel:0.22,0.56;",
    "ang_vel:-21.31",
    "pos:-1.62,0.85;",
    "rot:285;",
    "vel:0.20,0.52;",
    "ang_vel:-19.64",
    "pos:0.08,0.66;",
    "rot:273;",
    "vel:0.51,0.20;",
    "ang_vel:34.41",
    "pos:-0.50,1.19;",
    "rot:274;",
    "vel:1.68,0.84;",
    "ang_vel:-46.10",
    "pos:-0.05,1.42;",
    "rot:261;",
    "vel:0.71,0.36;",
    "ang_vel:-19.56",
    "pos:0.05,1.47;",
    "rot:258;",
    "vel:0.52,0.26;",
    "ang_vel:-13.55",
    "pos:0.87,1.27;",
    "rot:256;",
    "vel:3.87,-0.99;",
    "ang_vel:-8.65",
    "pos:1.39,0.45;",
    "rot:297;",
    "vel:0.58,-0.11;",
    "ang_vel:35.77",
    "rot:300;",
    "pos:1.61,1.27;",
    "rot:235;",
    "vel:1.20,0.00;",
    "ang_vel:-34.30",
    "pos:1.91,1.27;",
    "rot:226;",
    "vel:0.60,0.00;",
    "ang_vel:-16.45",
    "pos:2.07,1.11;",
    "rot:225;",
    "vel:2.85,-2.81;",
    "ang_vel:-14.55",
    "pos:2.32,-0.38;",
    "rot:342;",
    "vel:0.41,-0.39;",
    "ang_vel:32.44",
    "rot:348;",
    "pos:2.92,0.24;",
    "rot:200;",
    "vel:1.42,-1.20;",
    "ang_vel:-58.45",
    "pos:3.34,-0.11;",
    "rot:183;",
    "vel:0.58,-0.49;",
    "ang_vel:-22.86",
    "pos:3.38,-0.15;",
    "rot:181;",
    "vel:0.47,-0.40;",
    "ang_vel:-18.64",
    "pos:2.44,-1.59;",
    "rot:7;",
    "vel:0.03,-0.54;",
    "ang_vel:31.17",
    "rot:11;",
    "pos:3.51,-2.23;",
    "rot:160;",
    "vel:0.24,-1.49;",
    "ang_vel:-25.33",
    "pos:3.57,-2.57;",
    "rot:154;",
    "vel:0.12,-0.77;",
    "ang_vel:-12.65",
    "rot:272;",
    "pos:-0.81,1.06;",
    "rot:99;",
    "vel:-1.76,-0.39;",
    "ang_vel:74.91",
    "pos:-1.50,0.97;",
    "rot:354;",
    "vel:0.59,-0.05;",
    "pos:-1.31,0.95;",
    "rot:121;",
    "vel:-0.75,-0.16;",
    "ang_vel:30.51",
    "pos:-1.66,3.40;",
    "rot:126;",
    "vel:0.75,-5.21;",
    "ang_vel:1.67",
    "pos:-1.79,4.33;",
    "rot:188;",
    "vel:-0.04,0.35;",
    "ang_vel:2.31",
    "pos:-1.73,3.87;",
    "rot:343;",
    "vel:-0.16,1.28;",
    "ang_vel:8.89",
    "rot:344;",
    "pos:-1.45,0.92;",
    "rot:127;",
    "vel:-0.44,-0.10;",
    "ang_vel:17.95",
    "pos:-1.88,0.59;",
    "rot:129;",
    "vel:-3.12,-2.51;",
    "ang_vel:13.49",
    "pos:-0.70,1.11;",
    "rot:326;",
    "vel:-0.16,-0.00;",
    "ang_vel:24.22",
    "pos:0.88,1.11;",
    "rot:140;",
    "vel:0.15,-0.00;",
    "ang_vel:29.71",
    "pos:0.59,0.75;",
    "rot:143;",
    "vel:-2.44,-3.17;",
    "ang_vel:23.25",
    "pos:-1.27,1.68;",
    "rot:267;",
    "vel:1.11,0.80;",
    "ang_vel:-43.97",
    "pos:-2.93,2.12;",
    "vel:3.99,0.26;",
    "ang_vel:1.07",
    "pos:-0.97,1.89;",
    "rot:255;",
    "vel:0.43,0.31;",
    "ang_vel:-17.20",
    "pos:0.44,0.95;",
    "rot:157;",
    "vel:0.56,-0.08;",
    "ang_vel:34.55",
    "pos:0.10,1.63;",
    "rot:246;",
    "vel:1.79,-0.15;",
    "ang_vel:-36.74",
    "pos:0.56,1.59;",
    "rot:236;",
    "vel:0.79,-0.06;",
    "ang_vel:-16.24",
    "pos:0.68,1.58;",
    "rot:233;",
    "vel:0.52,-0.04;",
    "ang_vel:-10.80",
    "pos:1.28,1.11;",
    "rot:231;",
    "vel:3.13,-2.50;",
    "ang_vel:-7.18",
    "pos:1.54,0.17;",
    "rot:187;",
    "vel:0.49,-0.37;",
    "ang_vel:37.79",
    "pos:1.94,0.81;",
    "rot:214;",
    "vel:1.03,-0.47;",
    "ang_vel:-26.97",
    "pos:2.18,0.70;",
    "rot:208;",
    "vel:0.52,-0.23;",
    "ang_vel:-13.47",
    "pos:2.28,0.49;",
    "rot:207;",
    "vel:1.84,-3.55;",
    "ang_vel:-11.92",
    "pos:2.15,-0.97;",
    "vel:0.27,-0.52;",
    "ang_vel:35.88",
    "pos:2.82,-0.48;",
    "vel:0.94,-1.30;",
    "ang_vel:-44.96",
    "pos:3.08,-0.84;",
    "rot:175;",
    "vel:0.42,-0.57;",
    "ang_vel:-19.08",
    "pos:2.02,-2.17;",
    "rot:306;",
    "vel:-0.08,-0.54;",
    "ang_vel:34.04",
    "pos:3.11,-0.89;",
    "rot:174;",
    "vel:0.34,-0.47;",
    "ang_vel:-15.55",
    "pos:3.32,-1.63;",
    "rot:171;",
    "vel:1.74,-1.01;",
    "ang_vel:0.07",
    "pos:3.77,-1.89;",
    "vel:0.74,-0.43;",
    "ang_vel:0.03",
    "pos:2.19,-2.24;",
    "rot:319;",
    "vel:-0.02,-0.10;",
    "ang_vel:10.70",
    "pos:3.89,-1.96;",
    "vel:0.51,-0.30;",
    "ang_vel:0.02",
    "pos:0.76,1.11;",
    "rot:114;",
    "vel:1.22,-0.00;",
    "ang_vel:223.96",
    "pos:1.10,1.11;",
    "rot:176;",
    "vel:0.54,-0.00;",
    "ang_vel:95.03",
    "rot:265;",
    "vel:-0.07,-0.00;",
    "ang_vel:12.86",
    "vel:0.29,-0.00;",
    "pos:1.34,0.75;",
    "rot:202;",
    "vel:1.42,-3.74;",
    "ang_vel:42.00",
    "rot:14;",
    "pos:-0.49,-1.10;",
    "rot:31;",
    "vel:-0.70,-0.24;",
    "ang_vel:62.61",
    "pos:-0.67,-1.16;",
    "rot:48;",
    "vel:-0.30,-0.10;",
    "ang_vel:27.68",
    "pos:-0.70,-1.17;",
    "rot:51;",
    "vel:-0.24,-0.08;",
    "ang_vel:20.80",
    "pos:-1.56,-0.53;",
    "rot:55;",
    "vel:-3.29,2.28;",
    "ang_vel:11.74",
    "pos:-0.58,0.41;",
    "rot:196;",
    "vel:-0.11,0.22;",
    "ang_vel:23.94",
    "pos:-0.38,0.83;",
    "vel:0.25,-0.39;",
    "ang_vel:-7.72",
    "pos:-0.34,-0.80;",
    "rot:137;",
    "vel:0.14,-0.61;",
    "ang_vel:42.82",
    "rot:138;",
    "pos:-0.33,0.46;",
    "vel:0.54,-3.96;",
    "ang_vel:-6.29",
    "pos:0.01,-1.14;",
    "vel:0.18,-0.77;",
    "ang_vel:-7.36",
    "pos:-0.27,-2.83;",
    "rot:215;",
    "vel:0.02,-0.80;",
    "ang_vel:38.68",
    "pos:-0.28,-2.78;",
    "vel:0.02,-0.87;",
    "ang_vel:43.72",
    "pos:-1.55,0.70;",
    "rot:278;",
    "vel:0.59,-0.15;",
    "pos:0.26,1.75;",
    "rot:192;",
    "vel:0.45,0.45;",
    "ang_vel:73.43",
    "pos:-0.85,0.48;",
    "vel:0.24,-0.15;",
    "ang_vel:45.09",
    "pos:-0.73,1.09;",
    "rot:352;",
    "vel:0.56,3.08;",
    "ang_vel:31.23",
    "pos:-0.35,3.92;",
    "rot:333;",
    "vel:0.14,1.06;",
    "ang_vel:4.78",
    "pos:0.78,0.92;",
    "rot:213;",
    "vel:2.11,-3.40;",
    "ang_vel:31.16",
    "pos:0.73,6.14;",
    "rot:130;",
    "vel:0.18,0.37;",
    "ang_vel:0.31",
    "pos:0.32,1.81;",
    "vel:0.33,0.34;",
    "ang_vel:52.97",
    "pos:0.01,0.47;",
    "vel:3.36,2.18;",
    "ang_vel:2.58",
    "pos:0.22,5.27;",
    "vel:-0.89,-3.58;",
    "ang_vel:0.17",
    "pos:0.01,3.62;",
    "rot:85;",
    "vel:-1.85,-0.35;",
    "ang_vel:1.17",
    "pos:1.40,3.69;",
    "rot:80;",
    "vel:-3.91,0.85;",
    "ang_vel:0.09",
    "pos:-0.47,3.53;",
    "vel:-0.82,-0.15;",
    "ang_vel:0.52",
    "pos:-0.50,3.53;",
    "vel:-0.79,-0.15;",
    "ang_vel:0.48",
    "pos:-1.88,4.43;",
    "rot:245;",
    "vel:-0.84,0.11;",
    "ang_vel:35.13",
    "pos:-1.74,3.56;",
    "rot:81;",
    "vel:-2.36,-0.39;",
    "ang_vel:-42.21",
    "pos:-2.40,3.45;",
    "rot:69;",
    "vel:-1.04,-0.17;",
    "ang_vel:-17.91",
    "pos:-2.81,5.15;",
    "rot:313;",
    "vel:-0.39,0.34;",
    "ang_vel:33.04",
    "pos:-2.57,3.42;",
    "rot:66;",
    "vel:-0.69,-0.11;",
    "ang_vel:-11.43",
    "pos:-3.26,3.75;",
    "rot:64;",
    "vel:-3.60,1.75;",
    "ang_vel:-7.60",
    "pos:-0.74,1.11;",
    "rot:134;",
    "vel:-0.02,-0.00;",
    "ang_vel:3.41",
    "pos:0.89,1.11;",
    "pos:0.43,0.50;",
    "rot:145;",
    "vel:-2.31,-3.26;",
    "ang_vel:19.75",
    "pos:-2.54,0.95;",
    "rot:324;",
    "vel:-1.30,1.68;",
    "ang_vel:-24.10",
    "pos:-2.89,1.40;",
    "rot:317;",
    "vel:-0.58,0.74;",
    "ang_vel:-10.65",
    "pos:-1.24,0.59;",
    "rot:19;",
    "vel:0.01,-0.02;",
    "ang_vel:-1.38",
    "pos:-1.25,0.61;",
    "rot:98;",
    "vel:0.03,-0.06;",
    "ang_vel:-3.98",
    "pos:-2.97,1.51;",
    "rot:316;",
    "vel:-0.42,0.53;",
    "ang_vel:-7.38",
    "pos:-2.32,2.16;",
    "rot:314;",
    "vel:2.86,2.80;",
    "ang_vel:-4.52",
    "pos:-0.64,2.53;",
    "vel:0.55,1.09;",
    "ang_vel:-0.27",
    "rot:100;",
    "pos:-1.17,2.96;",
    "vel:0.44,1.24;",
    "ang_vel:-22.94",
    "pos:-1.05,3.29;",
    "vel:0.19,0.53;",
    "ang_vel:-9.73",
    "pos:-1.04,3.30;",
    "vel:0.18,0.51;",
    "ang_vel:-9.34",
    "pos:0.60,3.62;",
    "rot:228;",
    "vel:0.50,0.34;",
    "ang_vel:33.64",
    "pos:-0.10,4.06;",
    "rot:295;",
    "vel:1.35,1.55;",
    "ang_vel:-55.30",
    "pos:0.24,4.46;",
    "rot:280;",
    "vel:0.60,0.68;",
    "ang_vel:-24.44",
    "pos:0.34,4.57;",
    "rot:276;",
    "vel:0.40,0.45;",
    "ang_vel:-16.25",
    "pos:1.10,4.63;",
    "vel:3.99,0.24;",
    "pos:1.83,3.76;",
    "vel:0.56,0.05;",
    "ang_vel:33.01",
    "pos:2.16,4.81;",
    "vel:1.62,0.37;",
    "ang_vel:-29.01",
    "pos:2.59,4.91;",
    "rot:248;",
    "vel:0.69,0.16;",
    "ang_vel:-12.31",
    "pos:2.58,3.08;",
    "vel:0.29,-0.31;",
    "ang_vel:34.58",
    "rot:301;",
    "pos:1.85,1.90;",
    "vel:-1.34,-0.12;",
    "ang_vel:-20.04",
    "pos:1.59,1.87;",
    "rot:63;",
    "vel:-0.82,-0.08;",
    "ang_vel:-11.79",
    "pos:1.12,2.12;",
    "rot:61;",
    "vel:-3.51,1.92;",
    "ang_vel:-8.86",
    "pos:2.43,3.74;",
    "vel:-0.12,0.37;",
    "ang_vel:37.90",
    "rot:232;",
    "pos:2.37,4.33;",
    "vel:0.44,-0.15;",
    "ang_vel:-7.91",
    "pos:3.37,3.05;",
    "rot:347;",
    "vel:0.46,-0.40;",
    "ang_vel:44.64",
    "pos:3.93,2.98;",
    "vel:0.66,-0.54;",
    "ang_vel:-9.74",
    "pos:4.61,1.45;",
    "vel:0.58,-0.75;",
    "ang_vel:42.67",
    "pos:4.51,1.64;",
    "rot:177;",
    "vel:0.15,-0.42;",
    "ang_vel:-15.85",
    "pos:4.12,-0.24;",
    "vel:-0.22,-0.78;",
    "ang_vel:10.37",
    "pos:4.46,0.95;",
    "vel:-0.57,-7.18;",
    "ang_vel:-12.93",
    "pos:1.91,4.49;",
    "rot:234;",
    "vel:1.49,-0.51;",
    "ang_vel:-26.92",
    "pos:0.73,1.11;",
    "rot:118;",
    "vel:0.33,0.00;",
    "ang_vel:74.38",
    "pos:0.81,1.11;",
    "vel:0.15,0.00;",
    "ang_vel:32.88",
    "pos:-0.82,1.11;",
    "rot:144;",
    "ang_vel:3.48",
    "pos:0.82,1.11;",
    "rot:139;",
    "vel:0.13,0.00;",
    "ang_vel:29.09",
    "pos:0.04,0.07;",
    "rot:146;",
    "vel:-2.22,-3.33;",
    "ang_vel:14.53",
    "pos:-0.75,1.11;",
    "vel:-0.17,-0.00;",
    "ang_vel:25.74",
    "rot:328;",
    "pos:-2.72,0.65;",
    "vel:-0.97,1.13;",
    "ang_vel:-15.92",
    "pos:-2.99,0.96;",
    "rot:312;",
    "vel:-0.41,0.48;",
    "ang_vel:-6.75",
    "pos:-1.24,0.23;",
    "vel:0.09,-0.11;",
    "ang_vel:-3.49",
    "pos:-3.02,1.00;",
    "rot:311;",
    "vel:-0.36,0.42;",
    "ang_vel:-5.74",
    "pos:-2.03,1.84;",
    "rot:310;",
    "vel:3.06,2.58;",
    "ang_vel:-2.87",
    "pos:-0.94,0.18;",
    "rot:103;",
    "vel:-0.41,-0.16;",
    "ang_vel:-1.73",
    "pos:-2.50,-0.21;",
    "rot:204;",
    "vel:-0.61,-0.18;",
    "ang_vel:49.79",
    "rot:205;",
    "pos:-1.38,0.08;",
    "vel:-3.89,-0.92;",
    "ang_vel:-1.35",
    "pos:-4.50,-0.75;",
    "vel:-0.91,-0.25;",
    "ang_vel:50.10",
    "pos:-2.90,-0.24;",
    "rot:108;",
    "vel:-0.79,-0.16;",
    "ang_vel:2.81",
    "pos:-3.22,-0.31;",
    "vel:0.66,0.28;",
    "ang_vel:97.14",
    "pos:0.72,1.39;",
    "rot:180;",
    "vel:0.08,0.18;",
    "ang_vel:55.51",
    "pos:-0.57,0.24;",
    "rot:355;",
    "vel:-0.11,-0.28;",
    "ang_vel:44.46",
    "pos:0.72,1.40;",
    "vel:0.08,0.17;",
    "ang_vel:53.29",
    "pos:0.92,0.04;",
    "rot:194;",
    "vel:1.00,-3.87;",
    "ang_vel:25.56",
    "pos:-0.86,-0.88;",
    "rot:334;",
    "vel:1.34,3.77;",
    "ang_vel:2.03",
    "pos:-0.06,0.27;",
    "rot:357;",
    "vel:0.46,0.66;",
    "ang_vel:13.79",
    "pos:-0.11,1.95;",
    "vel:0.24,0.86;",
    "ang_vel:63.04",
    "pos:0.05,1.81;",
    "rot:12;",
    "vel:0.05,0.45;",
    "ang_vel:7.40",
    "pos:-0.10,3.43;",
    "rot:37;",
    "vel:-0.01,0.62;",
    "ang_vel:47.18",
    "pos:-0.35,3.25;",
    "rot:9;",
    "vel:-0.15,0.45;",
    "ang_vel:-2.11",
    "pos:-0.20,4.87;",
    "rot:112;",
    "vel:-0.04,0.62;",
    "ang_vel:42.28",
    "rot:113;",
    "pos:-0.49,4.07;",
    "rot:6;",
    "vel:-0.68,1.93;",
    "ang_vel:-30.28",
    "pos:-0.68,4.60;",
    "rot:358;",
    "vel:-0.30,0.85;",
    "ang_vel:-12.85",
    "pos:-0.02,6.25;",
    "vel:0.09,0.62;",
    "ang_vel:38.43",
    "pos:-0.74,4.77;",
    "vel:-0.18,0.50;",
    "ang_vel:-7.25",
    "pos:-0.70,5.23;",
    "vel:0.37,3.98;",
    "ang_vel:-5.68",
    "pos:-0.96,5.87;",
    "vel:-0.54,0.86;",
    "ang_vel:-15.70",
    "pos:-1.10,6.08;",
    "rot:338;",
    "vel:-0.25,0.40;",
    "ang_vel:-7.23",
    "pos:-1.04,6.22;",
    "vel:1.50,3.71;",
    "ang_vel:-6.66",
    "pos:-0.28,2.68;",
    "vel:1.84,2.07;",
    "pos:1.20,5.19;",
    "rot:209;",
    "vel:0.48,0.82;",
    "pos:-0.17,3.90;",
    "rot:263;",
    "vel:3.99,-0.28;",
    "pos:4.14,1.92;",
    "vel:0.84,-0.56;",
    "ang_vel:28.97",
    "pos:3.89,-0.11;",
    "rot:257;",
    "vel:-0.36,-2.83;",
    "ang_vel:11.33",
    "pos:2.79,2.93;",
    "rot:251;",
    "vel:0.81,-0.33;",
    "ang_vel:1.00",
    "pos:3.73,2.61;",
    "vel:3.78,-1.31;",
    "ang_vel:0.59",
    "pos:0.85,1.11;",
    "vel:0.14,-0.00;",
    "ang_vel:31.56",
    "vel:0.13,-0.00;",
    "ang_vel:27.92",
    "pos:0.03,0.00;",
    "rot:147;",
    "vel:-2.21,-3.34;",
    "ang_vel:13.39",
    "pos:-0.72,1.11;",
    "rot:327;",
    "pos:-0.98,0.91;",
    "rot:288;",
    "vel:0.43,0.09;",
    "ang_vel:3.40",
    "pos:0.48,1.58;",
    "rot:36;",
    "vel:0.60,0.22;",
    "ang_vel:54.15",
    "pos:-0.55,1.05;",
    "vel:3.80,1.26;",
    "ang_vel:2.66",
    "pos:1.02,1.39;",
    "rot:308;",
    "vel:0.82,0.16;",
    "ang_vel:11.15",
    "pos:2.28,2.48;",
    "rot:165;",
    "vel:0.83,0.42;",
    "ang_vel:61.47",
    "pos:2.27,2.33;",
    "rot:320;",
    "vel:0.38,0.27;",
    "ang_vel:6.56",
    "pos:3.47,3.44;",
    "rot:239;",
    "vel:0.51,0.42;",
    "ang_vel:46.57",
    "rot:243;",
    "rot:269;",
    "pos:-1.33,0.42;",
    "rot:16;",
    "vel:0.66,-0.28;",
    "pos:-1.00,1.47;",
    "rot:91;",
    "vel:-0.55,0.42;",
    "ang_vel:5.24",
    "pos:-3.05,2.79;",
    "rot:335;",
    "vel:-0.56,0.67;",
    "ang_vel:-5.76",
    "pos:-1.82,5.45;",
    "rot:220;",
    "vel:0.38,0.82;",
    "ang_vel:-0.75",
    "pos:-1.12,1.57;",
    "rot:93;",
    "vel:-0.29,0.22;",
    "ang_vel:2.73",
    "pos:-1.35,1.56;",
    "vel:-4.00,-0.20;",
    "ang_vel:2.41",
    "pos:-2.70,3.55;",
    "vel:2.21,4.77;",
    "ang_vel:-4.32",
    "pos:-2.40,4.30;",
    "rot:254;",
    "vel:3.88,-0.98;",
    "ang_vel:0.08",
    "pos:1.75,2.43;",
    "rot:224;",
    "vel:0.84,-0.43;",
    "ang_vel:50.15",
    "pos:0.05,2.53;",
    "vel:0.64,-0.66;",
    "ang_vel:22.61",
    "pos:1.03,2.61;",
    "rot:277;",
    "vel:3.97,0.45;",
    "ang_vel:13.30",
    "pos:4.76,0.21;",
    "vel:0.28,-0.97;",
    "pos:4.82,0.00;",
    "rot:161;",
    "vel:0.16,-0.55;",
    "ang_vel:-9.71",
    "pos:4.69,-0.36;",
    "vel:-1.36,-3.76;",
    "ang_vel:-7.92",
    "pos:3.41,-0.92;",
    "rot:360;",
    "vel:-0.23,-0.48;",
    "ang_vel:31.05",
    "rot:0;",
    "pos:4.20,-1.61;",
    "vel:-0.64,-2.02;",
    "ang_vel:-28.58"
  ],
  "vocab_out": [
    "<PAD>",
    "<BOS>",
    "<EOS>",
    "<UNK>",
    "turn_left_15",
    "+",
    "accelerate",
    "turn_left_90",
    "boost",
    "turn_left_45",
    "turn_right_45",
    "turn_right_15",
    "turn_right_90",
    "dash",
    "stay",
    "turn_left_73",
    "turn_left_62",
    "turn_right_37",
    "turn_left_26",
    "turn_left_46",
    "turn_left_30",
    "turn_left_22",
    "turn_left_32",
    "turn_left_27",
    "turn_left_41",
    "turn_left_37",
    "turn_left_34",
    "turn_left_44",
    "turn_left_76",
    "turn_left_67",
    "turn_left_111",
    "turn_left_20",
    "turn_left_36",
    "turn_left_51",
    "turn_right_131",
    "turn_left_24",
    "turn_left_33",
    "turn_left_31",
    "turn_left_56",
    "turn_left_69",
    "turn_left_84",
    "turn_left_59",
    "turn_left_52",
    "turn_left_72",
    "turn_left_54",
    "turn_right_56",
    "turn_left_29",
    "turn_left_57",
    "turn_left_77",
    "turn_left_42",
    "turn_left_86",
    "turn_left_65",
    "turn_left_43",
    "turn_left_50",
    "turn_left_70",
    "turn_left_87",
    "turn_left_58",
    "turn_left_64",
    "turn_left_47",
    "turn_left_48",
    "turn_left_60",
    "turn_left_23",
    "turn_left_82",
    "turn_left_75",
    "turn_left_28",
    "turn_left_71",
    "turn_left_38",
    "turn_left_40"
  ]
}